[
  {
    "content": "a 2.1 Need of Foundational Learning Skills (Reading with Comprehension, Writing and Numeracy) a. Developing a strong foundation of language, literacy, and mathematical skills in the early years (Age group 3 to 9) is critical to all future learning: The ability to read and write, and to perform basic operations with numbers, is a necessary foundation and indispensable prerequisite for all future schooling and lifelong learning. Early literacy and numeracy skills are not only foundational for learning but are correlated with greater quality of life and personal well-being and are critical for educational outcomes in later years. A robust foundation in literacy and numeracy helps children to learn, experiment, reason and create, to be active and later become informed citizens, and contribute socially, culturally, and economically. Literacy is no longer perceived as a simple cognitive skill but as a complex and active process with cognitive, social, linguistic, and psychological aspects (Teale & Sulzby, 1989). Children's concepts about literacy are formed from their earliest experiences and interactions with readers and writers. The process also involves their own attempts to read, write, and develop their own meaning and purpose of literacy skills. The idea is to focus on building the skills in early childhood education itself. b. This understanding of early literacy development complements the current research supporting the critical role of early experiences in shaping brain development: Surveys conducted by NCERT and other agencies show that the number of children NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy who cannot read is extremely high despite completing primary school. The studies are constantly drawing our attention to the grim reality of reading in early classes. c. Mathura pilot project: Achieving early literacy skills following the philosophy of emergent literacy was the objective of Mathura pilot project initiated by NCERT in 2007. It was implemented in l schools of 5 blocks of Mathura. Findings of the project showed that after the implementation of emergent literacy/, children could read with comprehension and made attempts to write on their own. d. The 'India Early Childhood Education Impact Study, (2017)' conducted by Centre for Early Childhood Education and Development {CECED) at Ambedkar University, UNICEF and ASER: This report mentioned that 'High quality Early Childhood Education programmes help the children to develop a conceptual and language foundation for later learning of reading, writing and mathematics'. Early childhood (birth to 9 years) is a",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "critical period of development and early literacy and early numeracy are two important skill areas that develop along with social, emotional, cognitive, and physical development of the child during this period. Literacy and numeracy development is intricately linked with participation of children in everyday communications, actions, thoughts and self expression in speech and initial forms of writing. Communication and bonding with family, and friends play an important role in developing early literacy skills. Resources and materials such as children's literature, stationery, art, and craft materials, counting objects enhances children's interest in reading, writing and numeracy. Relevant literacy experiences give them opportunities for self-expression in oral and written forms, reading with comprehension, pleasure, and critical perspective. It also develops good communication skills and personal social qualities. Their awareness of materials, shape, space, pattern, and difference, classifying, matching, comparing, and ordering are important for the development of numeracy. The knowledge, skills, attitudes, and dispositions developed in these early years impact significantly upon their later learning experiences. It is evident that the skills related to literacy and numeracy develops in integration with each other as per the child's experiences in daily life. In the initial years of learning, the skills of literacy and numeracy are learnt without making conscious distinction between languages and numbers e.g., the numeracy skills can be naturally learnt from their experiences of reading and writing, stories, poems, riddles etc. Guidelines for Implementation a e. 2020: The 2020 firmly recognises the importance of quality Early Childhood Care and Education (ECCE) and clearly stressed upon that. Over % of a child's cumulative brain development occurs prior to the age of 6, indicating the critical importance of appropriate care and stimulation of the brain in the early years in order to ensure healthy brain development and growth. ,, - 2020, Para l. l Therefore, it is imperative to have a quality ECCE programme in place to attain optimal outcomes in the domains of physical and motor development, cognitive development, socio-emotional-ethical development, cultural/artistic development, and the development of communication and early language, literacy, and numeracy.\" The National Policy on Education (2020) has focused on pre-school education and made it integral part of the education system. The needs and demands of child will be at the centre while formulation of curriculum for foundational literacy at early grades. The physical, motor, psychological, social, emotional, intellectual development of children of varied ages should be considered while",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "developing content for the children of early grades for the attainment offoundational literacy. f. The foundational literacy skills are nurtured in the school: Much depends upon the understanding and attitude of the teachers towards the language the young learners bring to the school. It is to be acknowledged that when children enter school, they have good control over at least one spoken language, are aware of environmental print and have experimented with written forms of communication through scribbling on walls, mud, paper, books, etc. These experiences of children reflect the fact that reading and writing develop at the same time among children and are inter-related. The goal in all reading situations should be 'to understand'. It is imperative that the message that is conveyed in the printed text be understood. Literacy is not viewed merely as decoding but rather the whole act of reading, including comprehension. (Mason and Sinha, 1993). NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy 2.2 Multilingual Classrooms a) Children bring their home language in the classroom, and their learning process should accommodate their languages as a resource and not as interference: Language reflects society. The values inherited in a society can be inferred from its language. Multilingual education can play a significant role in engaging diverse learners and ensuring academic success. In a typical Indian classroom, there will be children speaking more than one language. Further, there will be children who speak region specific language as their mother tongue. The foundational literacy skills can be developed on the linguistic and cultural resources of children. The natural ways of learning language are based on the fundamental idea that mother tongue is the best medium of comprehending, and learning. It has been observed that the learning achievements of the children suffer if they are not given support in using their own language for literacy learning. This happens very commonly when the focus remains on teaching learning of dominant language. This situation leads to the accumulation of load of incomprehension among children. The focus of foundational literacy practices should be on promoting multilingualism for learning in the classroom. Further, if the child has exposure to more than one language, the child becomes academically more creative and socially more tolerant. This also facilitates the development of divergent thinking among children. The wide range of linguistic efficiencies and skills that they gain through this helps them in",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "negotiating in different social situations more efficiently. 2.2.1 Multilingualism in Classroom a. Possible Situation 1: Child's language is different from the school language, and textbooks. b. Possible situation 2: Child's language and language of the school is common, but other children speak different languages. c. Possible Situation 3: Child's home language is combination of two or more languages, and language of the school is different. d. Possible Situation 4: In multilingual families there can be a home language spoken by other family members who may sometimes be different from mother-tongue or local language. (, 2020) Guidelines for Implementation a e. There could be more such situations in early years of education. To build a strong foundation of Literacy and Numeracy in the foundational years, it is crucial that the States/UTs map the children's spoken languages with that of the teachers' and provide for teachers who can negotiate the classroom transactions6 as per comfort of the children in their own spoken languages. 2.3 Defining education in the early years The National ECCE Curriculum Framework, 2013 conforms to the vision of holistic and integrated development of the child, with focus on care and early learning at each sub-stage of the developmental continuum, to support children's all round and holistic development. It also mentions that the pre-school curriculum must address the following interrelated domains of holistic development through an integrated and play-based approach: a. Sensory and Perceptual Development: Development of the five senses through visual, auditory, and kinaesthetic experiences. b. Physical, Health and Motor Development: Gross motor skills, fine motor skills, coordination of fine muscles with dexterity; eye-hand coordination; sense of balance, physical coordination, and awareness of space and direction; nutrition, health status and practices. c. Language Development: There is no linear progression of language skills, but the skills develop holistically. Children do not learn how to read first and then learn how to write. Language classroom experiences of teachers have shown that the processes of reading, writing, listening, viewing, and thinking develop simultaneously as learners become literate. In schools, these research findings and rich experiences of children should be built upon in the learning process. Emergent literacy perspective advocates literacy learning by interacting with meaningful texts for genuine purposes including enjoyment. d. Cognitive Development: Development of various concepts, including pre-number and number concepts and operations, (knowledge and skills related to comparing, classification, serration, conservation of space and quantity, one-to-one correspondence, counting); spatial",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "sense, patterns and estimations in measurement; 6 Classroom transactional modalities to deal with multi lingual situation, foundational literacy, numeracy, assessment etc. will be included in the capacity building programmes for teachers at national level through NISHTHA FLN and also at the State level through contextualised programmes. NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy data handling; skills related to sequential thinking, critical thinking, observing, reasoning and problem solving; and knowledge of concepts related to the physical, social and natural environment. e. Development of Creative and Aesthetic Appreciation: Exploring different art forms, developing dispositions, expression, and appreciation for artistic, dance / drama and musical activities. f. Personal, Social and Emotional Development: Development of self-concept; self control; life skills/ self-help skills; habit formation; initiative and curiosity; engagement and persistence; cooperation; compassion; social relationships; group interaction; pro-social behaviour; expressing feelings, accepting others' feelings. The 'Pre-School Curriculum' NCERT (2019) emphasises on three developmental goals that comprises of all the five domains rather than talking about each domain in isolation. One of the objectives of preschool is to help children become involved learners, think critically, be creative, collaborate, communicate, and connect with their immediate environment which are well aligned with the early literacy and numeracy skills. The overall development of the personality of a child through play, manipulation of concrete material for discovery, experimentation, and exploration is the purpose of preschool education. It emphasises on a print rich environment that allows young children to practice foundational literacy skills in their daily life, combined with age and developmentally appropriate pedagogical practices of key concepts and literacy skills. This lays the foundation of literacy learning in the preschool. It also suggests about how to plan the pedagogical practices in such a way that goes along with the developmental stages of young children in the age group of three to six years. 2.4 Language Acquisition a. The language acquisition journey for the child begins in the womb and continues throughout the child's school years. Even before birth, infants experience and process sensory stimuli that promote neurological development in the brain. b. It is understood that by the age of 5, children grasp the sound system, grammar and communicative competence of their home language(s) and acquire a sizable vocabulary. They learn to talk which is one of the most observable and significant achievements of their growing up years. For children, getting hold of newer language",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "tools with the passage of time means new opportunities for social communication, for sharing lived experience, pleasures and needs and for making better sense of the world around them. Guidelines for Implementation a c. It is worth mentioning that phonemic awareness and enriched vocabulary skills acquired during early years are one of the key predictors of effective language competence. It can be used as an effective resource for classroom teaching and learning by activating their previous knowledge and giving space to their lived experiences such as discussing a theme like seasons through songs or folk songs. The focus during acquisition is not the form or structure of the language's utterances, but purposeful and meaningful interaction through the act of communication itself. 2.5 Approaches to Teaching Language and Literacy a. Reading Readiness Model: Over the years, there have been much research on how and when a child learns to read and write. In the early 1950s, some theorists focused on maturation levels of children and believed that reading instruction should not be taught until children reached an age of mental readiness. The dominant theory was that reading readiness was the result of biological maturation. They believed that for formal reading instructions are necessary. In this reading readiness model, there are two ways in which theorists saw how children became prepared for instructions. 1. In Maturation view, researchers instructed families and teachers to not interfere with their child's natural development and advised postponing the teaching of reading until children were in kindergarten or first grade (6 years and six month of age). Arthur Gesell, a developmental psychologist advocated that instructions should be postponed until child naturally possesses some prerequisite skills. ii. On the other hand, in Experience view researchers believe that rather than waiting for children to be ready they need to experience pre-requisite skills to accelerate readiness. Instructions for pre-requisite skills can be seen as auditory discrimination, visual discrimination, visual motor skills and large motor skills. These skills were directly taught to young children to prepare them for formal reading instruction referred to as \"reading readiness'. The reading-readiness model implies that children need to acquire these four skills to prepare for literacy. These skills are taught systematically to all children with little concern for experiences and information that children might already have. We no longer accept the reading readiness model of literacy learning and development because it does not take into",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "consideration some of the key NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy aspects of engagement with oral language and print that promotes literacy acquisition. b. Emergent Literacy: By the 1980s, researchers challenged the perspective of readiness and believed in early literacy development. Researchers began to consider the importance of learning environment in which children interact and develop reading skills. The term emergent literacy proposes that literacy begins at birth in literate societies and continues till the child becomes conventionally literate (by grade 1 or 2). This view supports the notion that children in literate societies come to early childhood settings with rich yet diverse background of language experiences including recognizing written symbols and variety of conventional writing efforts from their homes. In addition to the linguistic development, child also gets inputs for development of numeracy skills such as handling numbers, thinking critically and creatively and develop spatial understanding. This stage of emergent literacy lasts till children begin to conventionally read and write. i. Emergent reading skills include awareness about print and pretend reading, including practices like 'look and say', i.e., reading words as pictures. . Emergent writing skills include drawing and scribbling to represent something and express themselves in a form of writing. There are many approaches, which were used to instil foundational skills in the students such as, phonics approach, keyword approach, whole language, however, all these approaches have their own limitations. Therefore, there is a shift in approach in recent times and balanced approach is favoured to get best results. 2.5.1 Balanced Approach In the recent years, there has been an attempt to blend multiple approaches for literacy teaching in the initial years. This has been described as a balanced approach. This model acknowledges the importance of the function (comprehension, purpose, meaning) along with the form (phonemic awareness) of the literacy processes focussing on that learning happens best in teaching language holistically. The balanced approach is where teachers follow what is appropriate for their classroom and where every child learns in a joyful and stress-free manner, by taking the best of multiple approaches. For example, being literate requires much broader language skills than simply reading and writing and therefore children should be given plenty of opportunities to make Guidelines for Implementation a meaning from texts, ask questions and read between the lines in many ways. In a balanced literacy approach, teachers encourage their",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "children to see reading and writing modelled ass/he reads/writes in front of them, children share and get paired in the reading activities and write with the teacher, children get scaffolded in their literacy learning and gradually start practicing reading and writing independently. This broadens the scope of giving autonomy, flexibility, opportunity for planning the literacy process as per the need of young children. It also acknowledges the diversity in language and socio-cultural perspectives. Teachers should be aware of reading instruction like Read aloud, Shared Reading, Guided Reading, Independent Reading, Modelled and shared Writing, Guided Writing, and Independent Writing for enhancing literacy skills. This is characterized by meaningful literacy activities that provide children with both the motivation and skills to become proficient and lifelong literacy learners. The Balanced Literacy approach advocates balancing what is taught, how it is taught and with what it is taught (Fitzgerald, 1999). NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy Recent shifts in Perspectives in Early years Literacy Education Major shifts that have occurred in the understanding of how children should be enabled to attain literacy are: a. Learning to read and write may be a necessary but not a sufficient aim of literacy education. A more central aim should be to enable students to use language skills to participate meaningfully and in an empowered manner in society. Oral language and literacy development activities must therefore be planned concurrently for children as opposed to sequential approach, to help children not only learn to read but also make meaning of reading and read with comprehension. b. New methods may be adopted for introducing them to the basics of language and literacy which are informed by the more recent research and understanding of emergent and early literacy which are sensitive to children's learning needs and contexts along with the early learning continuum from preschool to the primary stage. This understanding is based on the adoption of judicious and balanced approach to teaching reading and writing to young children instead of adopting either a purely whole language approach or phonics-based approach. c. Oral language development must be linked to learning of literacy and must be developed concurrently in children along with literacy skills. d. There should be an understanding and acknowledgement of the fact that both free drawing and independent writing are forms of expression related to literacy. e. It is critical that teacher's own",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "beliefs and knowledge related to early language and literacy need to be addressed to enable them to see meaning making as central to learning to read and write. f. Explicit modelling of literacy practices should follow a \"gradual release of responsibility model' which incorporates a range of reading/writing activities for helping children develop literacy skills, such as Read aloud/Modelled writing, Shared reading/writing, Guided Reading and thus graduating to Independent Reading/Writing. g. Language and early literacy education should lead to not only development of these skills and competencies but also to the development of critical thinking and reasoning. Guidelines for Implementation a 2.6 Early Language and Literacy Language is more than just listening, speaking, reading, and writing. Language serves the purpose of communication, thinking and making sense of the world through the processes of inferring and reasoning. a. Understanding Reading and Writing (i) Children begin to read the written material around them, like on wrappers of biscuits and toffees, posters on the roadside, etc. As soon as children start holding pen, pencil, chalk, they start scribbling and try to add some meaning or message to them - this is also a part of the beginning of writing. These are the signs of their early literacy and natural efforts of shaping meaning and not the results of any formal education. In fact, the cognition of reading and writing also develops like development of oral language in the day-to-day meaningful and workable contexts. (ii) The goal in all reading situations should be 'to understand'. It is imperative that the message that is conveyed in the printed text be understood. Emergent literacy perspective advocates literacy learning by interacting with meaningful texts for genuine purposes including enjoyment. This perspective focuses on all aspects of language (semantic, syntactic and grapho-phonic), and not merely on phonics (Sinha, 2000). (J (iii) Reading motivates students to read books ) independently, develop creativity, critical thinking, vocabulary, and the ability to express both verbally and in writing. It helps children relate to their surroundings and real-life situations. Thus, there is a need to create an enabling environment in which children read for pleasure and develop their skills through a process that is enjoyable and sustainable, and which remains with them for life. (iv) Writing is also a process of comprehending the thoughts and sharing it with others. It not only includes the process of joining words together rather it is a",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "systematic procedure of sharing the knowing, information and ideas in a coherent manner. Writing enables children to explore, shape and clarify their thoughts, and to communicate them to others. By using effective writing strategies, children discover and refine ideas and compose and revise with increasing confidence and skill. Emergent literacy perspective emphasizes on NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy similarities between oral and written language acquisition. Children's comprehension of their written language mostly depends on their effective use and understanding of oral language. Even before starting their formal instructional training for writing, children begin to interact with the literacy environment around them and start building connections between symbols and their meanings. b. Concept of Writing in the Classroom The learners who come to school are already proficient in the knowledge of conversational language and some important concepts of reading and writing. If the process of teaching is gradually developed by making this proficiency an important base, then learning to read and write will become an interesting and meaningful experience for children. The zig-zag lines of children's pictures convey a lot. The opportunity to draw motivates them to express their thoughts and experiences. In this phase of writing, teacher can facilitate in giving meaning to their drawings by writing for them in conventional manner. Writing/print is used to say something meaningful; such acts clarify this concept of literacy. This concept deepens with the increasing opportunities of reading and writing. Along with it, the technical aspects of writing also emerge like the direction of writing from left to right (in Hindi), from right to left (in Urdu), the shape of symbols, the space between two words. The understanding of these concepts slowly becomes visible in the effort of independent writing by children; in this phase the teacher should focus on formative assessment and explore the relationship between the reading and writing needs of the children. c. The process of developing skills in writing during the early foundational learning period are as follows: (i) Emergent Writing- drawing and scribbling: Children to be given time to draw during a language class and asked to talk about their drawing. Children's drawings slowly change to representational drawing when they start drawing from the environment like people, characters and start telling stories about it. Children also start including random letters (invented spellings) in their writing. As children gain more experiences in",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "language, they notice that words are made up of more than one sound, each word is a group of conventional letters. Guidelines for Implementation a (ii) Conventional Writing: As children progress in their writing, they start using formal rules of grammar, punctuation, and spelling. Overtime invented spellings are replaced by appropriate spellings. (iii) Writing Composition: It is observed that teaching of writing must be focused less on techniques and more and more with fundamental insights about how children process information for writing. Writing is a complex cognitive process, and it is important to understand the role and participation of the child as a writer in this process and writing as a thought process. Children share experiences or narrate/describe an incident making use of their understanding of conventional writing. (iv) Reading and writing association is necessary to understand the interdependence of reading and writing. Both processes are complementary to each other. Skills and concepts learnt during reading are used in writing, and those of writing, in reading. Therefore, the written messages of children should be read by them, and written assignments should be based on material read by them. In this way, the understanding of read material will help the children in the expression of their personal experiences. This process will motivate learners to use writing in meaningful contexts. Language Learning- An Everyday Process The children engage with language in their everyday without realizing it. In one form or another they make use of language and their knowledge about the language too. They know how to address their elders, teacher. They are listening to conversations, may be radio too, watching television- these are the sources from which they draw their language and use it for communication. There is a lot of written and printed material available at our homes, the house number plate; folk art (Mandha) on the walls of the house; calendar; company's name on the gas stove, name of the family head engraved on the utensils; name tattoos on the arms; page of newspaper; shopping lists; toothpaste box etc. What is important is the amount of attention paid to that writing or printed material. Children develop an understanding of reading and writing even before coming to the school. This pre-knowledge of the children can be considered as the foundation of developing their literacy skills. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy 2.7 Key Components",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "in Foundational Language and Literacy: Development of early language and literacy in the formative years requires developing a wide range of skills, knowledge, and attitudes. This also requires developing literacy to build comprehension, writing for self-expression, vocabulary enrichment, experiences of reading with pleasure, engaging in interesting conversation. Rich early language and literacy experiences also gives opportunity for getting familiar with the aspects of language such as fluency, word recognition, letter knowledge and phonological awareness. Oral Language Development Includes improved listening comprehension, oral vocabulary, and extended conversation skills. Children come to school with a rich repertoire of oral language of their homes. However, some children's home and school languages are quite different, and they need to acquire a new language at school. Even children who speak the same language at home and school need to continue to grow in their understanding and use of their mother tongue. The experiences in oral language are important for developing skills of reading and writing. Reading Comprehension7 Involves constructing meaning from a text and thinking critically about it. When a child can comprehend, she/he is able to explain, extend, give examples, make inferences, predict, and summarise what she has read. Thus, this domain covers the competencies of understanding texts and retrieving information from them, as well as interpreting texts. 7 Reading essentially is a process of meaning making and comprehension is an integral part of reading. There are multiple factors which makes reading a meaningful activity instead of just pronouncing some words. Some of these factors are as follows- Prediction- While reading the reader predict about the next word or next sentence. Comprehension- The reader tries to comprehend the content of the picture and the text. Self-Correction- Reader tries to re-read the content and sometimes correct their own pronunciation. Meaning Making- The reader tries to develop the meaning of the content which he or she is reading. Joy- Reading needs to be joyful process. The reading strategies are motivated by facts that written words have pronunciation, written words are part of sentence and a sentence has meaning; words are composed of parts, including letters and morphemes; the ultimate goal of reading is to extract meaning from text. Comprehension is an integral part of oral reading fluency. In a literacy rich environment the children are motivated to read with comprehension. Guidelines for Implementation a Concept about Print Before children start their formal instruction in literacy their",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "understanding about print is essential, as print conveys meaning and has its own purposes and features (ranging from direction of writing to turning of pages, reading of book cover, about the author, and text). Children need exposure to different types of print rich environment to develop the skill of comprehension. Writing Involves the ability to express themselves in writing in initial stages with their familiarity and understanding encoded sounds to write words. This process progresses towards conventional writing along with the presentation of thoughts or information in a logical and organized manner. Learning to write is a developmental process, starting with children scribbling and drawing in the preschool years. This domain includes the competencies of writing aksharas and words as well as writing for expression. Vocabulary Developing knowledge of a wide range of words and word meanings. This is not just about learning word definitions. If vocabulary is developed in contexts, children learn to use words in appropriate contexts. This domain includes the competencies of oral vocabulary, reading/writing vocabulary, and morphological analysis of words. Phonological Awareness Involves building an understanding of the sound structure of a language. The ability to notice, think about, and words with the sounds in spoken language that can be ultimately linked to the symbol system of the language. This domain includes the competencies of word awareness, rhyme awareness, and awareness of sounds within words which should emerge from their meaningful engagement with language. Decoding Involves deciphering written words based on understanding the relationship between symbols and their sounds. This domain includes competencies of print awareness, akshara knowledge and decoding, and word recognition. The aspect of decoding the text is important but it should emerge from a context of children. The purpose is to develop phonemic awareness. For this teachers should select familiar and interesting texts for drawing attention to the sounds of the words and letters, and not follow the alphabet in sequence. This is also based on the principle that young children should move from known to unknown age appropriate text. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy Reading Fluency Refers to the ability to read a text with accuracy, speed (automaticity), expression (prosody), and comprehension that allows children to make meaning from the text. Many children recognise aksharas, but read them laboriously, one-by-one. This hampers the process of understanding what is being read. Research links reading fluency to",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "comprehension as to comprehend a sentence, children should be able to decode it in about seconds. It leads to a quantitative model of reading efficiency that has a simple and transparent monitoring indicator8 Culture of Reading/ Inclination towards Reading Involves the motivation to engage with a wide variety of books and other reading materials. Children should be able to appreciate good literature and be able to respond to it in informed ways. Even incredibly young children demonstrate this by expressing interest in handling books, looking at illustrations and trying to \"pretend\" read. For developing the culture of reading the participation of family, community and school is important. The cultural of reading also promotes democratic values and personal social relationship for responsible citizenry in later years. 2.8 Pedagogies for enhancing language and literacy development a. Creating a Print Rich Environment: In a print rich classroom, children have many opportunities to interact with various forms of print. The displayed text needs to be meaningful, inviting, and relevant for the children. A class can be made print rich by labelling objects or places, writing children's names, displaying samples of children's emergent writing, creating word walls, labelling pictures related to the theme. The reading corner/reading area is a significant place for language learning and exploration. Various child-friendly components such as poem corners, message boards, theme boards, various charts like class responsibility chart, mid day meal chart, chart of stories etc., display boards (children's writings, drawings, collections, variety of texts, pictures with captions, instructional material developed by teacher etc.) may be developed and displayed on walls at the eye level of children. 8 Helen Abadzi, 2006, World Bank Report Guidelines for Implementation a b. Read-aloud is a practice where teachers, parents, and caregivers pick up an engaging story from a book and read it out. Variations in pitch, tone, pace, volume, pauses, eye contact, questions, and comments make for a fluent and enjoyable experience for children. Reading aloud develops their listening skills along with their interest in understanding the story. This session should be followed up by conversation with children and writing/drawing task. THINGS TO REMEMBER Read aloud the story in an interesting manner Reading focused on text direction and words Creating Book awareness and way of handling a book Material must be displayed & changed on a regular basis c. Listening, Telling and Writing Stories and Poems: Stories-whether they are about real events or",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "about events imagined by someone- bring new material to the attention of the children and becomes interesting material for literacy development. The teachers can provide children with the pleasure of listening to the stories. The skill of telling can only develop with time and practice. It is important to select age appropriate, interesting, stories related to children's familiar context and surroundings. And no story needs to be a single occasion. Good stories deserve many re-tellings. Discussion on the story can be initiated on the messages, perceptions, impressions which children gather from the story. The freedom to recreate a story and its characters in a way that is meaningful to child should be promoted. A teacher should create opportunities for children to talk about a story in any way they like, to extend it, substitute its characters, and to make up their own stories d. Songs and Rhymes: Children enjoy songs and rhymes. The rhyming words in the rhymes help children notice and play with oral language and construct their own words enriching their vocabulary. Activities like storytelling, rhymes and songs, free and guided conversations help children develop phonological awareness, vocabulary development, listening comprehension skills along with developing their attention span. e. Sharing Experiences: Children need to be given ample opportunities to participate in teacher-initiated conversations about their experiences with pets around them, characters/events of the stories, cartoon films, cleanliness, and favourite food. f. Drama and Role Play: When children are given the opportunity to engage in drama and role play, they learn to express themselves as well as learn new words. Drama is invariably a part of children's own traditional play activities and games. A story or part of the story can be enacted. It enriches all the skills of language learning-LSRW NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy (Listening, Speaking, Reading, Writing). Children can be involved in creating props, writing, and reciting short dialogues, invite/poster etc. It helps in becoming effective communicator and developing interpersonal skills and facilitate bonding with others. g. Picture Reading/Talk: With the help of picture books, and other relevant collection of pictures made available to children creates opportunities for reading with meaning making and speaking about them. h. Shared Reading: In shared reading, big books with relevant illustration and text are read in pairs or by the teacher involving children. The book has large font, illustrations, and simple text so",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "that all children can participate in reading and talk about the story. This also builds up their vocabulary, sense of directionality while reading. This also facilitates peer reading. Shared reading is important for early literacy and most effective for Grade l and Grade 2 children. 1. Activities based on Reading and Writing Corners: Every class should have a reading corner/reading area with a variety of age-appropriate children's literature. Children should be provided enough time and opportunities to spend time with the books. There should be stationery and art craft material for self-expression. I Use of Classroom Wall: Various activities can be designed around the stories and poems read by the children. They can draw pictures, list familiar and unfamiliar words, and display them on the walls of the classroom. Green strips (Haripatti) can be used for writing, drawing by the children. These strips can also be used to display the works of children, attendance chart and other informative and interesting materials to motivate children to read and write. k. Experience Based Writing: Daily experiences of classroom or outside world are important opportunities of writing. Some prescribed time of the class may be devoted daily to share the experiences of the previous day in class and to write them. Further, the learners may be encouraged to write their own daily in their own words. They may also be given opportunities to develop stories and poems from their own experiences. Teacher must spend more time with children who are struggling to read. Mixed groups could also be made where weaker children benefit from peer support. Guidelines for Implementation a I. Mid-day Meal: It is also one of the routines with which children have a deep connection and they take keen interest in it. Different activities can be planned around this. For instance, a teacher can draw pictures of food, utensils etc. and initiate conversation on mid-day meal, eating habits, health and hygiene, nutrition, junk food, foods of different cultures, plants, and environment, etc. m. Use of Textbook and other Resource Materials: Teachers may use textbook and other resource materials including, stories and poems to provide opportunities of writing. Careful planning can make a connection between these textbook lessons and children's literature available in the class and children can enjoy the material related to one content/subject. If the writing activities related THINGS TO REMEMBER Each day the teacher may select one of the",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "activities suggested for oral language Activities to be conducted not only in Class 1 but in all primary classes to textbook are made more interesting and meaningful instead of traditional question-answer and fill in the blanks, writing will soon become interesting medium of expression. Further, use of different resource materials like, posters, story books and poems may provide ample opportunities to learners to engage with written text and will surely facilitate the process of writing. Children need to be exposed to a range of children's literature for independent reading, shared reading as well as read aloud. These are critical for children to develop sustained literacy skills as well as develop critical thinking, imagination and creativity. There is a need to have carefully selected books that are suitable for children with varying age group, reading abilities and diverse interests. There should be relevant, age appropriate books in the Functional library, which may be set up in every FLN class. This will be active and dynamic where teachers and children can share their books. This may include UDL books. The criteria for the selection of children's literature should be determined and there should be space for literacy activities. The books should be kept within the reach of the children. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy 2.9 Developing literacy skills in third language/English a. The pre-existing knowledge of language helps in building literacy skills in languages. Children who have a strong foundation in their home language can learn second and third languages more easily. The literacy engagement for third language/English language learners requires connectivity and linkages to what they know in their first language. However, children do not become literate automatically; careful and sensitive planning is essential; Presenting language as story reading and storytelling, in the first language, and in English ensures authentic engagement with meaning, and unconscious acquisition of recurring language. It also promotes aspects of language use ranging from punctuation, spelling, and paragraphing, to reading and writing multi-lingually. b. The recitation of rhymes gives them an understanding of implicit music/sounds in words and pleasure in the rhythm. This activity motivates children to pursue learning the language. c. Reading texts which are translations of what they have read in their mother tongue or first language into English facilitates their comprehension leading to developing vocabulary in English. d. In the above context, the teacher should allow the",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "use of code-mixing and code-switching to children for expressing themselves. This is essential for ensuring the development of creative and even critical thinking among children. e. The context of texts in English should not be culturally and socially alien to children because this will hamper the process of meaning-making. The multilingual scenario becomes a resource for learning English specifically in situations where its reach is minimal. In such a situation teacher must take note of words which children speak in English and weave some activities around them. All such activities should be followed first in the child's language in the form of facilitation. f. On-going assessment of children's knowledge acquisition and skills helps teachers develop meaningful and outcome-oriented learning plans. A significant challenge for the teacher is to create interest in reading in English beyond the textbook curriculum which children may find difficult to access. Provide them opportunities to express themselves in more than one language or their first language and English. Let children make use of their prior knowledge in LSRW by engaging them in pre-reading while reading and post-reading reflections. Guidelines for Implementation a How to develop reading habit among children? Availability and access to a variety of simple and interesting storybooks - illustrated with attractive pictures - in the children's classrooms. Children need to be provided dedicated time on a regular basis and a comfortable space to read in the classroom. Activities to be conducted like read alouds, shared reading, discussions on books read by them, role plays, etc., to increase their involvement with books and to develop a habit of reading. Useful Resources SAATHAQ: Students' and Teachers' Holistic Advancement Through Quality Education ( Implementation Plan, MoE https://www.education.gov.in/sites/upload_files/mhrd/files/upload_document/SARTH AQ_Part- l _updated.pdf https://www.education.gov.in/sites/upload_files/mhrd/files/upload_document/SARTH AQ_Part_2.pdf Abadzi, Helen. 2006. Efficient Learning for the Poor: Insights from the Frontier of Cognitive Neuroscience. Washington, DC: World Bank. (c)World Bank. https://openknowledge.worldbank.org/handle/l 0986/7023 License: CC BY 3.0 IGO Fitzgerald, J. (l ). What is this thing called \"balance\"? The Reading Teacher, , volume 2 l - l The pre-school curriculum, NCERT, 2019 https://ncert.nic.in/ dee/pdf/Combined_Pre_school_curriculum Eng.pdf NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy Teale, W. H., & Sulzby, E. (1989). Emerging literacy: New perspectives. In D.S. Strickland & L. M. Morrow (Eds.), Emerging literacy: Young children learn to read and write (pp. 1- ). Newark, DE: International Reading Association. Mason, J. M., & Sinha, S. (1993). Emergent literacy in the",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "early childhood years: Applying a Vygotskian model for learning and development. In B. Spodek (Ed.), The handbook of research on the education of young children (pp. -). New York: Macmillan. Sinha, S. (2019). Early Literacy Instruction in India. Improving Early Literacy Outcomes, l 0 1-. https://doi.org/1 0.l l /9789004402379 USAID, CECED & CARE, 2016, Early language and literacy in India: A position paper CECED, Ambedkar University Delhi & ASER Centre. (2017). The India Early Childhood Education Impact Study. http://img.asercentre.org/ docs/Resea rch%20a nd%20Assessments/Current/Education /Research%20Projllts/llLEIStudyReport20l 7.pdf UNICEF (2019), Early Literacy and Multilingual Education In South Asia UNICEF (2020), Guidelines for Design and Implementation of Early Learning Programmes https://www.unicef.org/india/media/2586/fi le/Guidelines-for-Design-and- 1mplementation-of-Early-Lea rning-Programmes.pdf Guidelines for Implementation a 3.1 Introduction a. Foundational Numeracy: Foundational Numeracy means the ability to reason and to apply simple numerical concepts in daily life problem solving. When children acquire the following skills, it is said that they have developed number sense and spatial understanding. It includes the ability to: 1. Make an understanding of quantities. ii. Develop concepts like more and less, and larger and smaller. . Establish relationships between single items and groups of items (seven means one group of seven items which is one more than a group of six items). Iv. Use symbols that represent quantities (7 means the same thing as seven). v. Compare numbers ( is greater than 8, and three is half of six). vi. Arrange numbers in a list in order: 1st, 2nd, 3rd, etc. vII. Visualise shapes and space around them. b. In general, the numeracy skill includes: i. Solving daily life problems using four fundamental operations - addition, subtraction, multiplication, and division. . Relating mathematical knowledge with the surroundings; applying logic to daily life, thereby developing ability to think mathematically, and taking logical decisions with reasoning. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy 3.2 Need of Early Mathematical Skills a. Numeracy is important for developing logical thinking and reasoning in daily life. We need numeracy to solve problems and make sense of numbers, time, patterns, and shapes etc. for simple daily life activities like cooking, traveling, playing, shopping, communication etc. These are not just skills, but life skills which every child should acquire and develop. Focusing on the basic numeracy skills in the foundational or early years will eventually improve the achievement of learning outcomes at later stages. b. Dealing with numbers and spatial understanding are",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "integral part of any communication and daily life discourse. Without being able to do basic calculations, a child cannot progress in the education system and eventually in life. No doubt some skills develop naturally with the daily life experiences and the context in which child grows, but a systematic intervention helps in building a strong understanding of mathematical ideas that lays a foundation for having better life skills like criticality, creativity, communication, and problem solving. c. It is noteworthy that it is during early years that the mathematical foundations are laid and can be effectively complemented with the provision of relevant and meaningful learning experiences to the children. The major determining factors for effective foundational Mathematics learning are awareness and understanding of concept of early Mathematics skills among stakeholders, teacher's and teacher educator's competence, curricular flexibility, and availability of resource material for teachers and children through pedagogy that keeps child's contextual experiences at the center. d. From a future perspective, research has also linked foundational numeracy to increased employability and higher GDP. It is directly correlated to increased workforce participation and opens opportunities for social and economic advancement. These basic skills make an individual well-equipped for facing life situations and have better life outcomes. 3.3 Maior aspects and components of Early Mathematics a. During the learning of Mathematics at early stages, a child is expected to: 1. Count and understand the numeration system. . Learn conventions needed for mastery of Mathematical techniques such as the Guidelines for Implementation a use of a base ten system to represent numbers. . Perform simple computations in her/his own way up to three-digit numbers and apply these to their day to life activities in different contexts. 1v. Understand and use standard algorithms to perform operations of addition, subtraction, multiplication, and division on numbers up to three digits. v. Learn vocabulary of relational words to extend his/her understanding of space and spatial objects. v1. Identify and extend simple patterns starting from repeating shapes to patterns in numbers. v11. Collect, represent, and interpret simple data/information in his/her daily life activities. b. These have been put into 7 major themes: i. Pre-Number concepts ii. Numbers and operations on numbers iii. Shapes and Spatial Understanding iv. Measurement v. Patterns v1. Data Handling v11. Mathematical Communication The early Mathematics skills associated with each topic are elaborated further along with opportunities for enhancing these skills. 3.3.1 Pre-Number Concepts Mathematicians and",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "psychologists have often argued that before children start counting objects or develop an understanding of number, they need to be able to classify, order and set up one-to-one correspondences to some extent. Since these skills are preliminary to the understanding of numbers, they are called as pre-number concept. The following are the essential requirements for counting: Every time when objects in a group are counted the objects are classified into two subgroups of objects counted and to be counted. While counting is done it is important to organise or serially arrange the objects so that neither an object is counted more than once, nor some objects are left NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy uncounted. Number names in an order or serial need to be known before attempting to count. A one-to-one correspondence is established in the groups of objects and the numbers like for every group there is a corresponding number and for every number a group can be formed. Children grow up counting their toys, toffees, people at home or other small sets of objects. They are often asked who has more/less or are there enough objects in their regular conversations. So, when schools begin to develop the understanding of pre-number concept, they should build upon the child's experience from his/her familiar context. a. Classification involves putting together things that have some characteristics in common. So, when organising tasks on classification, we must make sure that the activities are meaningful to them and, they are familiar with the objects which she/he must classify. Initially children should be encouraged to classify on one property/characteristic only. Gradually, complexity of the task should be increased where they can classify on more than one property such as colour, size, shape etc. This will later help them in understanding number sense. b. Seriation involves ordering a set of objects according to some rule. Intrinsically, it also involves ordering objects in two directions. For example, the child applies the relations 'bigger than' and 'smaller than' at the same time. It also means understanding the logic of transitivity which means that if A is more than B and B is more than C, then A is also more than C. Seriation also forms the base for understanding of patterns. Thus, it should be build using the objects from the familiar contexts of children and initially using 3 objects only.",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Gradually, children should be presented with more objects to seriate. c. One-to-one correspondence involves matching or pairing of objects. For building upon the understanding of one-to-one correspondence, children need to understand the meaning of 'many and few', 'more than/ less than' and 'as many as'. Teachers need to design tasks contextual to child's context so that the child relates and uses them in daily life experiences. Thus, while introducing a concept, we should devise as many different activities as possible with variety of materials, so that children can correctly glean and generalise it. At every point they should be encouraged to talk about what they are doing and how they are doing it giving them ample space to express. Teachers need to use concrete material and toys available around the child in providing opportunities to develop above pre number skills. Guidelines for Implementation a 3.3.2 Numbers and Number Operations a. All children must have ample opportunities of developing the ideas of numbers and operations on numbers in their local context within and outside their syllabus. b. Numbers are the mathematical tool to count and measure. Numbers are used in many forms. Three major types of numbers are Cardinal numbers, Ordinal numbers, and Nominal numbers. Cardinal numbers are used to measure and communicate the size of a group of objects, e.g., students of class V went for a picnic. Ordinal numbers are used to describe the position of an object when they are arranged in a specific order, e.g., Fourth child from the left has brown hair. Nominal numbers are used as nouns/labels to identify the object in a group, e.g., Train number 2298 has just left. c. The key skills that come under this category are number sense, reading of symbols, writing words and symbols, comparison of numbers like bigger than/smaller than etc., fundamental operations - addition, subtraction, multiplication, division, and their applications in daily life. d. Problems involving operations such as addition, subtraction, multiplication, and division are not merely abstract uses of numbers. These operations have wider applications in daily life. The operations of addition and subtraction are complementary to each other. Addition is a combination/aggregation of distinct sets of like entities while subtraction is the exact opposite, i.e., take away or left over from a set of elements. Similarly, multiplication and division are also complimentary to each other. Multiplication is done by repeated addition while division by repeated",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "subtraction. These operations are not just to develop computational abilities in children but to use them as tools for problem solving in daily life context. This would feed into the higher aim of mathematics as a problem-solving tool. The problems which commonly use addition and subtraction involve an increase or decrease of some quantity, combination of two or more objects and comparison of objects. A common strategy to represent subtraction problem are \"take away\"/ \"left over\" problems. There are some informal strategies in dealing with addition and subtraction of small numbers as it helps to build a \"number sense\". These operations are useful to interpret, represent and solve simple problems in daily life context. a) By acquiring these skills, the child should be able to achieve the following- Quantification: Counting objects in a collection (Visualization, Generalization) NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy Counting as a means for solving problems such as determining quantity/ comparing (Problem Solving) Associate number concepts, vocabulary, quantities and writing numerals to communicate (Communication) Abilities to combine, separate and name \"how many\" concrete objects leading to operations of addition and subtraction for small collections (Problem solving, Communication) b) The following approaches can be followed to achieve these skills: - While teaching numbers, concept of groups of tens should be used using a variety of objects like sticks, pencils etc. Involve children in matching and sorting objects using one-to-one correspondence and ordering objects that vary in colour, size, or other parameters Encourage children to count different groups of objects and to think about quantity and number. Use strategies that help children learn to count accurately and efficiently such as pointing to/touching/moving each object being counted. Draw attention to numbers and how they are used such as house addresses, prices of objects marked on packets, etc. Use words related to estimation - more than, less than, about, nearly, approximately, and in between. Ask children to estimate or how many by looking at a group of objects. Encourage them to test for the actual answer. Play games that include counting and using numbers like simple board games, card, or dice games etc. Give children problem solving situations involving combination, taking away, equal distribution of objects so that they can make the concept of addition, subtraction, multiplication, and division. Engage students with some fun loving and learning based activities so that they can develop the",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "concept of different operators. Encourage children to use the vocabulary like together, take away, number of times, equal sharing. Guidelines for Implementation a 3.3.3 Shapes and Spatial Understanding a. Spatial understanding: Spatial understanding is the area of mathematics that involves shape, size, space, position, direction, and movement. It helps describe and classify the world we live in. Spatial sense gives children an awareness of themselves in relation to people and objects. The key concepts include 3D shapes and solids, flat and curved surfaces of solids, 2D shapes as seen on surfaces of a solid shape e.g., straight lines, curved lines, shapes made up of straight lines, curved lines etc. e.g., triangles, quadrilaterals, circles etc. b. By acquiring these skills, the child should be able to achieve the following- 2D Shapes: circle, rectangle, square and triangle 3-D Solids: like cube, cuboid, cylinder, cone, sphere Observe the objects in the environment and get a qualitative feel for their geometrical attributes. Use her own vocabulary to describe space and the shapes of various familiar objects. Identify various elements of an object such as edges, corners and faces while exploring and playing with them. Explore and communicate the association between an object (3D) and its shape (2D) Draw simple shapes on paper and trace and explore the outlines of objects on paper. Trace her way in space by talking of direction and spatial relationships. Since children are familiar with the shapes of objects around them, it is better to explain differences between shapes by making a connection with other objects like this is round like a ball etc. When children use their own language or common vocabulary, they can communicate what they find through their explorations. It helps them to generalize and to understand the concept better. Later, they can relate this base of understanding to the formal mathematical vocabulary. Children can be taken on exploratory walk to the nearest places and then asked to draw its map using the various landmarks they observed during the walk. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy The teachers may follow the approaches given below: Encourage children to identify different shapes as they draw, look at different objects, work with puzzles, building with blocks. Give children many opportunities to handle objects such as blocks, boxes, containers, shape sorters and puzzles. Encourage children to climb in and out of boxes or large block",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "structures, on or around outdoor equipment, and over, under, around, through, into, on top of, and out of different things to experience themselves in space. Encourage children to make new shapes by putting materials together and taking them apart in different arrangements. They can do this by moulding clay playing with blocks. Introduce spatial vocabulary, including location and position words - on/off, over/under, in/out, above/below, front/behind, top/bottom, movement words - up/down, forward/backward, toward/away from, straight/curving, distance words- near/far, close to/far from, shortest/longest etc. 3.3.4 Measurement a. Measurement in daily life situations: There are numerous situations that we encounter in our daily life which involves dealing with quantities, for example, buying clothes, constructing wooden items and buildings, cooking a meal for guests etc. Children are often involved in activities like comparing their heights, checking whether there are enough sips of water left in their water bottle, how much time is left for the lunch break, refusing to lift a heavy item, letting hot milk to cool down before consuming it, and so on. In this way children acquire an informal understanding of several physical attributes such as length, weight, volume, time, and temperature. Measurement is inherent part of human life, whether being used in the accomplishment of routine work or in an occupation. Thus, familiarity with different contexts of measurement is important for functioning effectively. This majorly contains the understanding of the following attributes of measurement Length/distanee Weight/mass Volume/capacity Time Temperature Guidelines for Implementation a b. Planning learning of measurement: We should use the experiential learning of children, and natural context to develop and plan learning activities. Focus should be made on designing activities that have inbuilt challenge in the form of a problem which children can easily relate to and find interesting. As children start to learn the various attributes of measurement, they are introduced to vocabulary of comparison. Learning starts with comparing an attribute of objects directly (comparing length of a pencil and a scale) and then moves to indirect comparison (comparing length and height of the blackboard). While teaching indirect comparison, we use another intermediary object for example, a string could be used to compare the length and height of the blackboard. Later, they should be introduced to non-standard units such as hand span or a stick. c. Comparing and measuring: There is a big difference between comparison and measurement as measurement involves the use of number. The",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "number describes how many matchsticks longer is a pencil, how far is my school from home, how many cups full of water will fill a jug completely, how many peas will balance a potato etc. Efforts should be made to ensure that children understand the necessity of unit of repeat in measurement, so that they will understand the importance of standard units. Later when they will be introduced to instruments used for measuring like ruler, weighing scale, clock, thermometer etc. they will not simply read the readings but know how they have been constructed and why we use them. While comparing and measuring, children should be encouraged to make a guess or do a visual estimate first, and later to verify their guess or estimate by carrying out more systematic comparison or measurement (or by using a specific instrument). For example, let children guess whose arm is longest among them. See what all ways they suggest for comparison, and provide them with some strings, matchsticks, paper strips, etc. Let them think and select the most suitable way. Help them use it and finally reach the answer. Children can be shown two different shaped containers filled with unequal amount of water (not much difference in amount of water) and can be asked to guess which has more/less water. Observe what arguments they put up to justify their answers and have an elaborate discussion. Provide them some identical glasses and prompt them by asking, 'can we use these glasses to find out which bottle has more water? d. Approaches for teaching measurement: Thus, measurement is a skill that is inherently activity-based. There is plenty of opportunity for children to measure and to work in groups. Measurement involves NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy both understanding and skill. The following approaches may be followed by teachers: Give ample opportunities to use language of comparison - use appropriate attribute words for different situations. Let children figure out their own units for measurement. Children better understand standard units like metres, centimetres, grams, litres, etc when they have lots of experiences working with their own ways of measuring and comparing in non-standard units. Involve children in activities such as block building, cooking, crafts and other experiences that involve measurement. Look for opportunities to help children make comparisons and measurements of volume, height, weight, length and temperature in day-to-day conversation. Provide",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "simple experiences that help children begin to develop an understanding of time concepts by comparing how long different activities take. Start with daily time references (after the story, before lunch) and proceed to more abstract concepts (yesterday, tomorrow, months, years, etc.) 3.3.5 Patterns a. Patterns in our daily lives: Patterns are all around us. The word pattern is used in almost every context of our daily lives such as decorative designs, figures, motifs, shapes etc. Mathematically, a pattern is an arrangement, order, sequence, or repetition. The sequence of daily activities forms a pattern in a child's life that the child can recognize. Patterns can also be seen in numbers, shapes, sounds etc. Arrangement, repetition, and order are important in many branches of Mathematics. Patterns can be identified based on color, shape, size, etc. b. Patterns in mathematics: As patterns are all around us, it is important to develop the understanding of pattern. Identification of the pattern helps in enhancing observation and analytical skills as while identifying pattern, one observes the similarities, dissimilarities, repetition, non repetition, growth/decay etc. Describing patterns helps in enhancing vocabulary and improving language which is one of the important aspects in mathematics learning. c. Pattern Types: Patterns can be identified based on a particular rule. For example, counting numbers have a pattern- each number is one more than the preceding number and each Guidelines for Implementation a number is one less than the succeeding number. Patterns can be of many types like sound patterns, number patterns, patterns in shapes, patterns in colours, patterns based on symmetry etc. d. Four steps to teaching patterns: Working with patterns usually consists of four major steps. Teachers need to conduct appropriate activities within and outside classrooms to develop the conceptual idea of Patterns among children. Some suggestions are: 1. Identifying pattern: Pattern can be identified by observing the rule which the pattern is following for example, if it is a repeating pattern, progressing pattern etc. like 1,2,1,2... or2,5,8,, .... . Describing the rule: After identification of pattern, next step is to describe the rule and identifying the unit of repeat (In case of repeating patterns). Let children see patterns around them and form rules to extend like patterns on sarees, tiles, boarders, etc. . Extending pattern: Further extending the pattern by using the unit of repeat. For example, in the pattern 1, 2, 3, 1, 2, 3, 1, 2, 3, the",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "unit of repeat id 'l, 2, 3'. So, by recognizing this unit of repeat, the pattern can be extended further as 'l, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, and so on'. Similarly, for any repeating pattern, once the unit of repeat is recognized by the child, he/she can easily extend the pattern. Iv. Creating new patterns: Once the child can achieve the above three steps, child can start creating new patterns by identifying, analyzing, extending and exploring patterns further and using his/her own creativity. Example: 0, 5, , , , , ...... Patterns with dots NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy 3.3.6 Data Handling a. Data in everyday life: Data refers to information in a raw form which is collected from various sources. Having access to data and the capacity to interpret data can be a source of power. The availability of data, which is reliably and systematically collected, makes a system transparent. This is important for a democratic society. It is only when people have confidence in their own capacity to handle and interpret data that they will also seek data. We collect data when we need to answer a specific question, a problem or when we want to understand a situation in generality. This may be because we need to decide. It is noteworthy that though data answers some questions, at the same time it raises further questions which cannot be answered from the data. Data collection and handling are usually thought of as a part of statistical activity and so only of interest to people specializing in statistics. We rarely acknowledge the fact that in everyday situations, we are collecting and using data. A teacher is collecting data even when she takes the attendance of children in her class. b. Data components: The major components of data handling include collecting, representing, and interpreting simple data, recording data using tally marks, collecting data, and representing in terms of pictograph, choosing appropriate scale and unit for display through pictographs, drawing conclusions from the data. c. By acquiring these skills, the child should be able to achieve the following: 1. Attempt to record information in her/his own way. ii. Participate in discussions with others to draw inferences from the recorded information. . Devise ways to present the recorded information in such a way",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "that its interpretation can be made simpler. 1v. Show/describe problems in interpretation of information. v. Devise pictorial ways of representing information like pictograms and bar graphs. d. The following approaches should be followed: 1. Organise activities and provide opportunities to record information in numbers and to draw inferences or make decisions out of it. Guidelines for Implementation a ii. Involve children in discussion to highlight the importance of recording of information. iii. Create situations such that child uses her/his ways to record and present the information in a meaningful manner. 1v. Give opportunities to children for exploring ways of recording and presenting data and draw inferences from the data. v. Encourage children to participate in activities and discussion, raising questions, making interpretations, etc. v1. Engaging students with group assessment where students work as a group and collect and present data and draw inference based on it. 3.3.7 Mathematical Communication: Mathematical communication refers to a process by which information is exchanged between individuals through mathematical symbols, signs, diagrams, graphs. It encompasses both listening and reading (comprehension) and both speaking and writing (expressions). a. Understanding Mathematical Communication: Language plays a crucial role in the construction of knowledge and in the learning of mathematics as well. Every discipline has a specialized language. Mathematics also borrows words from everyday language but gives them special meanings. When the children begin solving simple problems presented through words in the mathematics class, they begin working with mathematics language. 'How many?\"How many altogether?' 'How many are left?'- all these are examples of the use of mathematics language. Children mix such mathematical language with their ordinary, everyday language while discussing a mathematical problem. Children learn by constructing their knowledge through interaction with their environment. A critical part of constructing knowledge is the communicating of ideas with peers and others. Initially such communication takes place in and through child's home language. While sharing, new thoughts and ideas are generated. While doing any activity, the child tries to understand her/his own or others' actions and this happens when children communicate with each other. This communication is possible only through a language that the children are comfortable in. For example, while exploring a spherical object, the child may relate it with laddoo and calls it 'laddoo jaisa', instead of 'golakaar'. Notice that when the children use the phrase, 'laddoo jaisa', for a spherical object, they are making correct categories. NIPUN BHARAT: Notional",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Initiative for Proficiency in Reading with Understanding and Numeracy b. The following approaches may be followed by teachers to enhance mathematical communication: Use simple, friendly, and clear language that relates with home language. While giving oral and written instructions use blackboard and ask questions or shapes a discussion. While introducing mathematical ideas, symbols and signs a careful connection is required to develop with child's own language. If teachers make a conscious effort to analyse the language that they use to communicate with children and use language wisely, a big change can be seen in the teaching-learning process. Appropriate opportunities need to be provided to all children to communicate their ideas through newer terminology in a stress free and friendly environment. Initially children should attempt to use mathematical language without any fear of being wrong. Gradually they will improve their mathematical communication with time and concerted opportunities. 3.4 Pedagogical Processes to enhance Foundational Mathematical (Numeracy) Skills: a. Important Mathematical Skills: Quality Foundational education should work on developing the following mathematical skills in children through the early mathematics concepts such as Observation, Reasoning, Visualization, Generalization, Communication, Critical thinking, Problem-solving, Creativity and Collaboration. Such pedagogical processes should be adopted inside and outside the classroom which provide equal opportunities to all children despite their socio economic and cultural background. The teachers and parents have to devise/design appropriate activities and material contextual to child's surroundings and experiences. All activities and interaction with children should focus on experiential learning and use of manipulative and concrete material. b. Some of the suggested processes are given as under: Learner Centric Pedagogy: A change in the role of teachers from information providers to facilitators must be done. This should also be re- Guidelines for Implementation a emphasized in the curriculum, textbooks, and teacher training curriculum, which should focus on development of skills rather than content. It should enable child to solve other real-life situation problems too and not just textbook problems. Providing scope for Exploration and Mathematical Thinking: The classroom environment should cultivate the spirit of exploration and visualization of concepts that lead to mathematical thinking. Different ways of calculations and strategies for problem-solving need to be explored (other than employing standard algorithms) along with many diverse ways of communicating the results of exploration. The teacher should create situations/contexts for creating understanding and exploration. Use of Manipulative /Toys (Toy Pedagogy): Providing hands on experience is an integral part of",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "mathematics, especially in the lower classes. It provides an implicit understanding of concepts in children which a child may not get when told explicitly. Toys and manipulatives also help children in visualising of concepts. Many indigenous toys are generally available in every child's surrounding. These should be used as important resource of teaching and learning of mathematical skills. Mathematics with daily life: Pedagogy should be such that the understanding with real-life applications is given more space, like including life application projects and assignments. Assessment of these projects and assignments should be part of the all-round year long school-based assessments. Medium of instruction: The language which a child brings from home, plays a big role in mathematics classroom. The instruction should be given in home language, so that he/she can easily understand it. Mathematics learning should not seem like learning some foreign language for the child. No doubt, a strong linkage of the home language with the language of mathematics will help the child in understanding and communicating mathematical ideas. Integrating mathematics with other subjects: Mathematics is not only a subject, but also a language which is used in learning of all other subjects like different languages, environment, science etc. Short stories, poems, rhymes, simple riddles usually involve different aspects of our life and provide opportunities to think holistically and link mathematics with other subjects or vice-versa. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy Communicating Mathematically: Creating a classroom environment that provides confidence among students to raise doubts, ask questions, participate in discussions, and share her/his thoughts and imagination. An environment should be created where the child expresses his/her observations, understanding and the teacher is moulding that understanding mathematically. The skill of meaningful problem posing need to be enhanced to think and communicate mathematically. For example, the teacher can ask the students to describe their position in mathematical terms - I have three people in front of me and four behind, or I am sitting at one of the corners of a square, etc. Giving space to alternate strategies supporting Problem Solving: Creating facts and formula - not promoting rote learning of facts, formulae and procedures should be encouraged in a mathematics classroom. Instead of emphasizing on standard algorithms, the teacher should encourage diverse ways of problem solving with peer learning and collaborative learning. A teacher should provide support and confidence to the students when they",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "struggle with problem-solving so that mathematics anxiety is avoided. Joy in Mathematics (Recreation with Mathematics): Mathematics curriculum needs to emphasize on experiential learning and provide scope for learning flexibility by integrating the use of poems, rhymes, stories, riddles and puzzles, local art and culture, music, dance, rap songs, cooking, and games, etc. to help students enjoy the learning. Space for errors in child's room: In all mathematics classrooms, every response/question of the student needs to be treated with respect. Care needs to be taken about discussing them with the class. Such an environment would encourage students to raise questions and voice their doubts. Moreover, child's errors provide a window to the teacher and parents to understand child's thinking and the way she/he is progressing in learning mathematics. Collaborative learning: Collaborative or group learning should be practiced with students i.e., learning from each other and helping each other to learn. Such an approach would have the teacher focus on many other aspects of the classroom. Peer learning also helps children in developing conceptual understanding and mathematical communication without any fear and hesitation. Guidelines for Implementation a Useful Resources The Department of Education and Skills, LITERACY AND NUMERACY FOR LEARNING AND LIFE: The National Strategy to Improve Literacy and Numeracy among Children and Young People l l -2020. https://www.education.ie/en/Publications/Policy-Reports/lit_num_strategy_full.pdf Danahy, Laurie Early Numeracy (2020, April ) https://www.olaweb.org/assets/documents/csd EarlyNumeracy.pdf Fuson KC (l ). Children's counting and concepts of number. New York: Springer Verlag Gelman R, & Galistell CR (l ). The child's understanding of number. Cambridge, MA: Harvard University Press. Bisanz J, Sherman JL, Rasmussen C, & Ho E (2005). Development of arithmetic skills and knowledge in preschool children In Campbell JID (Ed.), Handbook of mathematical cognition (pp. -). New York: Psychology Press. Lefevre J-A, Fast L, Skwarchuk S-L, Smith-Chant BL, Bisanz J, Kamawar D, & Penner Wilger M (2010). Pathways to mathematics: Longitudinal predictors of performance. Child Development, , 1753-1767. [PubMed] Purpura DJ, & Ganley CM (2014). Working memory and language: Skill-specific or domain-general relations to mathematics? Journal of Experimental Child Psychology, , l - l. [PubMed] NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy a The teacher was waiting for them. \"You all worked hard this morning,\" she said, \"so what would you like to do this afternoon?\" Before Totto-chan could even begin to think about what she wanted to do, there was a unanimous shout. \"A",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "walk!\" \"All right,\" said the teacher, and the children all began rushing to the doors and dashing out. Totto-chan used to go for walks with Daddy and Rocky, but she had never heard of a school walk and was astounded. She loved walks, however, so she could hardly wait. Out of the gate they went--all nine first grade pupils with their teacher in their midst- and began walking along the edge of a stream. Both banks of the stream were lined with large cherry trees that had only recently been in full bloom. Fields of yellow mustard flowers stretched as far as the eve could see. The children chatted away about anything they liked as they walked along. The sky was blue and the air was filled with the fluttering of butterflies. After they had walked for about ten minutes, the teacher stopped. She pointed to some yellow flowers, and said, \"Look at these mustard flowers. Do you know why flowers bloom?\" She explained about pistils and stamens while the children crouched by the road and examined the flowers. The teacher told them how butterflies helped flowers bloom. And, indeed, the butterflies seemed very busy helping. Little did the children realize then that these walks--a time of freedom and play forthem--were in reality precious lessons in science, history, and biology. Excerpt from TOTTO-CHAN-The Little Girl at the Window, by Tetsuko Kuroyanagi, translated by Dorothy Britton NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy 4.1 Learning Outcomes and Competencies Learning outcomes are statements that describe the knowledge, skills and attitudes, students should acquire by the end of a particular assignment, class, course, or program, and help students understand why that knowledge and those skills will be useful to them. The combination of knowledge, skills, attitudes, and values form the competencies that are expected to be developed in everyone. They focus on the context and potential applications of knowledge and skills, help students connect learning in various contexts, and help guide assessment and evaluation. In competency-based education, teaching and learning focuses on acquiring these basic competencies which can be measured through learning Outcomes. The National Council of Educational Research and Training (NCERT) developed \"Learning Outcomes (LOs) at the Elementary Stage\" in 20179 for each class and subject. These learning outcomes were the result of wide consultations and field trial in different types of schools located in different parts",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "of the country. In continuation, learning outcomes for the secondary stage10 have also been developed in 2019. These are expected learning achievements which are spelt class-wise. These learning outcomes are not suggested in hierarchical manner. Learners can achieve these learning outcomes at their own pace and skills. Teachers are provided with pedagogical and assessment inputs to follow process-oriented methods of achieving the stated LOs. They can design and provide a variety of learning situations/opportunities as per the needs of different learners in an inclusive classroom. These LOs have served as guiding points for the teachers and the stakeholders and are being used widely to assess the progress of learning of children in different classrooms. 4.2 Importance of Competency Based Learning a. Unique Experiences of Children: Children come to school from different backgrounds and contexts-some children have parents and adults in the family who engage with them-play, tell stories, provide interactive language experiences, provide safety, connections, and high-quality routines, which are enriching and interesting for children. On the other hand, there are children who have experienced less engaging and enriching early childhood years, without secure attachments, safety and connection, good nutrition, and rest, 9 Learning Outcomesat ElementaryStage, https://ncert.nic.in/pd//publicotion/otherpublications/tilopsl O l .pd/ Learning Outcomes at Secondary Stage Stage https://ncert.nic.in/pd//publication/otherpublications/learning_outcomes.pd/ Guidelines for Implementation a and without enriched learning opportunities. As a result, children have differences in readiness for school when they begin preschool or kindergarten. Additionally, children in the same class might have a -month age difference. There are differences in the levels of language skills, visual-motor skills, and social readiness. Children having varied levels of oral language development, second language learners, diversity in home atmosphere may result in different types of learners having different learning needs. b. Competency Based Learning: When children from diverse backgrounds having different learning, needs enter the formal school, all of them are expected to be ready for grade-level content to be covered and tested in a time-limited learning system. In many schools in India, children are offered non-responsive instruction which does not serve their learning needs, but focus is on completing the syllabus without monitoring what children are learning. One-size-fits-all instruction and testing quickly classifies children into winners and losers. By the end of third grade, children have settled into patterns of learning that usually persist for life. An alternative to the traditional learning system is the competency-based learning. Competency based learning is focused on student learning",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "outcomes, and is characterized by the following: Explicit and measurable learning outcomes are defined which are the pathways for competency acquisition. The pedagogy is based on activities, experiences, integration of arts/sports/ technology, etc. and connecting the learnings to real-life situations, so that child learns to apply knowledge. Children advance to the next level of learning outcomes only upon achieving certain level of proficiency at the current level11 Primarily formative assessment is used, and skills or concepts are assessed in multiple contexts to ensure that both deep understanding and applications are acquired by children. World Closs - How to build a 21st century school system; by Andreas Schleicher, published by OECD page -, \"Mastery learning builds on the understanding that learning is sequential, and that mastery of earlier tasks is the foundation on which mastery of subsequent tasks is built. According to American psychologist John Carroll, student learning outcomes reflect the amount of time and instruction a student needs to learn, and whether the opportunity to learn ond quality of instruction are sufficient to meet students' needs. For teachers, that means that they do not vory the learning gools, which hold for the entire doss, but that they do whatever is needed to ensure thot eoch student hos the opportunity to learn the material in ways that are appropriate to him or her. Some students will require additional instruction time, others will not; some students will require different learning environments thon others. Behind this thinking is the deep belief that all students can learn ond succeed, ond thot the task of teachers is to design the learning environments, whether inside or outside the classroom, that help students realise their potential.\" NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy In the competency model, instruction is designed to match the developmental readiness of the students. Students are given instruction at their personal level of readiness for as long as necessary to achieve desired competency. Moving to the next level is not determined by time or age but by the mastery of the competency. This can be different for different competencies/subject areas. With such flexibility, students fall in love with learning and become successful learners. For higher rate of success, instructions should be provided at a level that is challenging for children. c. Assessments in Competency Based Learning: Formative assessments are emphasized so that teachers get to understand where students",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "are facing difficulties, having misconceptions so that they can be extended help and are given feedback about their performance and where they need to improve. Assessment is used as a guiding tool, which is meaningful and provide positive learning experiences for children. Students construct their own knowledge by actively participating, applying critical-thinking and problem-solving skills along with good communication skills, collaboration, and cultural responsiveness to help them work in ever-changing, diverse environments. 4.3 Life Skills in Early Grades a. Life Skills: Competency-based education requires focus on competencies arising out of a combination of abilities in the domains of knowledge, skills, attitudes, and values. Life skills are defined as a set of abilities, attitudes and socio-emotional competencies that enable individuals to learn, make informed decisions and exercise rights to lead a healthy and productive life and subsequently become agents of change. Life skills promote mental well-being and competence in children as they face the realities of life. These skills support the development of foundational skills such as literacy, numeracy, digital skills. In today's digital age, everything is changing at an amazingly fast pace and therefore to adapt to new situations, children need to be taught to focus and exercise self-control, think critically, work collaboratively, take on challenges, make connections and engage in self-directed learning and develop effective communication skills. The early years are a time when children begin to develop self concept and their feelings of competence and confidence as learners. The knowledge, attitudes, and skills that children acquire during these early years serve as the foundation for future success in their school and community and prepare them to be effective global citizens. Guidelines for Implementation a b. Decision Making Skill: Making good decisions is a life skill that every child should begin learning at a young age. Children are required to make decisions and choices. The decision-making process involves identifying the issue, gathering data, generating possible courses of action, evaluating alternatives, and making a thoughtful decision based on the information available. The curriculum should be based on making connections, constructing knowledge by building on prior knowledge and involving students in meaningful tasks that relate to real life. By involving children in projects, they are practising their organizational, collaborative and time management skills. c. Organising Skills: Children learn through routines, schedules, and habits. Teaching children, the values of sharing, caring, working cooperatively, organizing spaces by keeping the toys back, tidying up",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "and sharing classroom experiences with their parents is also important. Spaces at home and in school should be organised in such a way that children know where to keep their belongings like bags, shoes, clothes etc. This provides security to children and they learn to develop self- control and focus. Inform children about the expectations each day like tidying up after the activity, stacking the toys back etc. The value of routines and schedules should also be instilled in children from a young age. d. Communicating Skills: To build healthy social-emotional skills, children require communicating with others and needing high-touch personal interactions every day. When adults listen, talk, and respond to children by providing undivided attention, children also learn to listen carefully and learn to read social cues. They also learn to consider what they want to communicate and how it can be communicated in the most effective way. Confidence in speaking, discussion, debate, writing, and problem solving provides a good start for acquiring the skills. Students become independent in their own learning, where teachers assume the role offacilitators, guiding them through their learning process. e. Encouraging Curiosity: Children should be fully engaged in the learning process. They should be assisted in making personal connections and making meaning of the new material and integrating these learnings with what they already know. Facilitating the transfer of knowledge and skills to real-life situations is important. Children should be encouraged to think and ask questions when they do not understand. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy The primary aim of education is that the learner will acquire knowledge, understand what has been acquired and make informed decisions in the application of that knowledge to solve problems. The process necessitates thinking. Thinking is the contextual connection between the relevant pieces of knowledge; thinking connects the dots. With reading and writing, if the learner is unable to make connections between the content and their life, the content loses meaning. Schools should provide an environment where students can develop the ability to see relationships between subjects, content, and skills as well as between school and life outside of the classroom. 4.4 Integrated and Holistic Development through 3 Goals The 2020 has focused on the holistic development of the child. There are different domains of development like physical and motor development, socio emotional development, literacy and numeracy development, cognitive development, spiritual",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "and moral development, art, and aesthetic development which are interrelated and interdependent. These developmental aspects make child competent to deal with complex life situations. All these domains have been subsumed into three major goals which are briefly discussed here: Guidelines for Implementation a Developmental Goal 1 : hildren Maintain Good Health and Wellbeing (HW) a. The foundational years are of critical importance for laying the foundation for optimal physical, socio-emotional, and psychological health and well being of children for life. These are the years when children, given the right opportunities and encouragement, are developing the five senses, strengthening their larger and finer bones and muscles, and refining their eye hand coordination, which is also one of the prerequisites for being able to write in later years. b. Alongside, their sense of identity and social skills are developing, as they initiate and engage in more and more play activities with other children, initially in pairs and then gradually in smaller and then larger groups. Thus, they learn to play, work, and live with others in harmonious ways. c. They also begin to appreciate how each one of them is different and how these differences need to be not only accepted but respected. d. Most important of all, children need to experience a sense of autonomy and confidence in their own growing abilities and achievements and develop healthy habits leading to a good physical health and development of self esteem and a positive self-concept, which if appropriately nurtured, will stay with them for life. e. This goal continues to provide experience for health and well-being, socio emotional development, health, nutrition, hygienic practices, and safety from FYl -FY6 which covers age group 3 to 9 (Pre School to Class Ill - consisting of 2 years of Anganwadi/pre-school, one year of Balvatika and 3 years in primary school) NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy Developmental Goal 2: Children Become Effective Communicators (EC) a. By the time three-years old come into a preschool in monolingual cultures, they have typically already begun to communicate their needs, likes and dislikes orally in their home language, which is also the school language. b. The experiences provided during the foundational years are required to build on all these early experiences and exposure and further enhance their communication skills so that they can orally share their thoughts and feelings or describe their experiences more",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "effectively. c. It also ensures that children can receive and share information and develop higher order skills such as critical and creative thinking. They gradually learn to read and write with comprehension in that language. d. However, this scenario is possible only in contexts where the medium of instruction or interaction in schools is the same as the child's home. Given our country's multilingual context, we have many children whose home language is different from the medium of instruction in school or preschool. These include contexts such as that of tribal languages or dialects of regional languages and the contexts of English medium preschools where children come in with little or no familiarity with oral English/school language. Starting children on reading and writing without ensuring their oral language base results in children learning to read mechanically through simple decoding, but without much comprehension. Since all school subjects are language-mediated, this early learning gap inevitably has an adverse impact on children's later performance in school. In addition to this challenge, we have many children who are first generation learners and do not have an environment of literacy at home. They may not have seen books or had anyone reading to them or have a vague concept of print, text or meaning and value of reading and writing activity. Therefore, it is imperative that teacher communicate with the child in his language in pre-school and once the child is comfortable and learns to express himself, the teacher may introduce school language or language used in the state as medium of instruction. This will lay the foundation of language and literacy at the pre-school (3-6 years) and this goal will lead to subject- first/second language for example Hindi/state language/English. Guidelines for Implementation a Developmental Goal 3: Children become involved learners and connect with their immediate environment (IL) a. Children are born curious and enchanted about the world - its colours, its shapes, its sounds, its sizes, and its forms. This ability to connect with others and to share feelings with them lays a special basis for learning- the cultural social basis of human learning. Children notice and explore patterns, shapes, and other mathematical dimensions in their immediate world. Children begin to understand the world around them by making sense of it as they 'see' it. Children's learning in the cognitive domain needs to be facilitated through development of their five senses and encouragement",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "of the 3E's, i.e., Exploration, Experimentation and Enquiry, based on children's prior knowledge and immediate context. b. A major goal of foundational years education is, therefore, to help children move towards more logical thinking by helping them graduate from their perception-bound to more concept-based understanding. This gets addressed by helping children form concepts related to the world around them through direct experience and interactions with the physical, social, and natural environment. c. A sound for planning their learning experiences could help them develop understanding or knowledge for the environment, through the environment and of the environment. d. Mathematical thinking and reasoning is an important domain of cognitive development. The foundation for this abstract rule-based thinking gets laid through activities that are meaningful for the child. Mathematical thinking involves thinking about objects and their quantitative and spatial relationships. To begin with, a sense about these relationships emerges and based on these, the patterns and the more abstract concepts develop. During early childhood, we can see a path of development for the foundational ideas of mathematics-from what are known as pre-number concepts related to a sense of quantity, size, distance, length, width, weight, and height to sense of numbers and algebraic ideas and from sense of shape and space to geometrical ideas NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy 4.5 Codification of Learning Outcomes a. The Learning outcomes for Foundational learning have been divided into 3 three developmental goals: Goal 1-HW (Health and Well-being), Goal 2-EC (Effective Communicators), Goal 3-IL (Involved Learners). Key competencies of each goal are highlighted. These competencies have been drawn from the documents 'Pre-school Curriculum' and 'Learning Outcomes' developed by the NCERT. Also, the perspectives of language and mathematical thinking, design learning etc. as envisaged in the 2020 has been taken care of. b. Each learning outcome has been given a number/code for easy identification and referencing. It is important to understand that these numbers are not hierarchical, but these experiences can be provided simultaneously in an integrated way. c. The developmental goals have been further divided into six levels corresponding to the 3 years of ECCE followed by 3 years of schooling. d. For criterion referenced measurement, NCERT and SCERTs to develop item banks on DIKSHA platforms tagged to the uniform coding system as laid down in Annexure I. e. All textbooks developed by NCERT/SCERTs for the Foundational Years may also use",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "this uniform coding system. f. Description of the codification HW 1 1 .... .... .... Guidelines for Implementation a Details of the Developmental Goals, competencies, and codification of learning outcomes are given in Annexure I. Understanding the linkage between developmental goals, competency and learning outcomes * DEVELOPMENTAL GOALS: There are different domains of development like physical and motor development, socio-emotional development, literacy and numeracy development, cognitive development, spiritual and moral development, art and aesthetic development which are interrelated and interdependent. These developmental aspects make child competent to deal with complex life situations. All these domains have been subsumed into three major goals for holistic development of the child. * COMPETENCY : Competencies are statements that specify what children will know, be able to do, or be able demonstrate when they have completed or participated in a course or program * LEARNING OUTCOMES: LOs are essentially evidence of having acquired competencies. Learning outcomes are specific statements that describe exactly what a student will be able to do in a measurable way. There may be more than one measurable outcome defined for a given competency. .... Goal l: Children maintain good health and well being .... KEY COMPETENCIES .... Learning Outcomes (One or more LOs for every competencies) HOLISTIC DEVELOPMENT OF THE CHILD .... Goal 2: Children become effective communicators .... KEY COMPETENCIES .... Learning Outcomes (One or more LOs for every competencies) .... Goal 3: Children become involved learners and connect with their environment KEY COMPETENCIES .... Learning Outcomes (One or more LOs for every competencies) NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy EXAMPLE OF COMPETENCY AND LEARNING OUTCOMES Cl C 0: s 1)1 0 3 \" :l (1) ::J 0 o ::J Chapter 5 TEACHING AND LEARNING: 0 0 D OP APAB 0 D Guidelines for Implementation a Jiten never liked the English classes in school, particularly the spelling tests. TV and games were always on his mind - so much more exciting. And the less said about Ms. Sheela's strictness the better. Being asked to write a paragraph on \"the day that everything went wrong\" ... how boring. He could not wait for class to get over and meet Amit, Shankar, and his other friends. So, it was with a heavy heart that he sat in class on the first day of the new year... except instead of Ms. Sheela, was a smiling Ms.",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Arnita. And what had happened to the tables... they had been arranged in a circle - how odd. Perhaps she didn't' know the rules, this new teacher. Jiten watched as Ms. Arnita did not open the textbook. Instead, she turned to the class and asked each of them to draw picture of their favourite place or thing in the town. She gave us the option of writing a line under the picture if we wanted. Jiten drew an ice-cream with an attempt to draw the ice-cream shop as well. He kept wondering - what does all of this have to do with English. And yes, I'd better not write... I could make spelling errors. Ms. Arnita went through each of the drawings and said \"What a lovely town we all live in. You know there is a sports event for children roughly your age coming up in May. Wouldn't it be nice if we could make a story that introduced people to our town? Let us do it. Let us use the pictures you drew as a starting point. Of course, we'll have to add some writing as well but don't worry about that yet\" And so \"Project Welcome\" was born. Jiten was grouped with two other children one of whom was good at spellings though Ms. Arnita seemed quite tolerant about the errors. They decided to write about all the eating places in Jeevan Nagar that young people like. Jiten wanted to mention that the ice-cream parlour had a freezer, so the ice-cream was always good. So, he asked Ms. Arnita how that word was spelt. NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy Children are born with innate curiosity and eagerness to learn about their immediate surroundings. Thus, it is important that young learners falling in the age group of 3-9 years are provided with rich experiences through well-planned appropriate activities that develop communication skills, critical thinking, problem-solving and understanding about themselves. The pedagogical practices must include activities and experiences keeping in mind the WHOLE CHILD, all aspects - cognitive, socio-emotional, language and literacy, psycho-motor and creative development, which are inter-dependent, and interlinked. 5.1 Maior Aspects and Components of Teaching Learning Process 5.1.1 Content Under FLN Mission, the focus lies on providing appropriate opportunities in early literacy and numeracy. With a focus on Language, Literacy and Numeracy, Learning and development in children is holistic",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "and it advances in the areas of health, cognition, linguistic, personal, and social development and well-being simultaneously. Children learn in different ways, styles and at different pace. 5.1.2 Learning Environment The learning environment should be designed according to the varied learning needs of learners. A classroom should have a print rich environment and math/manipulative objects, puzzles, toys etc. for children. Also, the classroom should provide children with the opportunities to engage in meaningful written expression. Materials such as drawing sheets, writing sheets, coloured pens, sketch pens, colours, pencils, white board and other writing resources should be made available to encourage children to write to express. A strong linkage of activities within classroom should be made with the experiences that children have at home. The activities conducted in school must continue at home in a friendly environment including parental engagement. Guidelines for Implementation a 5.1.3 Prior Planning The following steps help the teachers to handle variations in early learning: Collect and select suitable range of toys and materials that enable learners and teachers to connect with listed concepts and skills for the age group of 3 to 9 years. Collect and plan activities for learners of varied contexts, according to their interest, abilities and needs, to keep them engaged and help them acquire meaningful and developmentally appropriate skills. Once the child is enrolled, their developmental level is to be identified to plan further strategies; this would help to carry out the early developmental screening of ALL children and identify their strengths. Early intervention minimizes learning difficulties and accelerates child development. The curriculum content then needs to be made flexible and accessible to children with different abilities. 5.1.4 Methodology to adopt age and developmentally appropriate pedagogical practices: Based on children's interests, needs and abilities, following methodologies need to be considered: Teacher guided and child-initiated learning. Balance between concrete and abstract ideas Balance between teacher and learner's dialogue (teacher initiated and child- initiated interaction) Connections with the child's previous knowledge Use and integration of technology in daily schedules. Use of open-ended materials to enhance thinking and questioning skills. Continuum in pedagogical practices from preschool to classes l - 3(spiral lessons) Continuous observation of children's progress in foundational literacy and numeracy Connections with children's home language and daily experiences Smooth and seamless transitions from Pre-school, Balvatika and between classes l -3. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy 5.1.5",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Suggestive pedagogical processes for achievement of learning outcomes a. Pedagogical Practises: Pedagogical processes are the strategies to be used by the teachers to transact the curriculum in such a way that learners learn by exploration, observation, investigation, expression, problem-solving and critical thinking to achieve the specified learning outcomes. Teachers need to align pedagogical practices, curriculum content, materials, and resources to achieve the desired learning outcomes. One of the especially important pedagogical practices is knowing and reviewing previous learning or knowledge of children. Then after selecting and planning the goal-oriented activities for achieving learning outcomes for literacy and numeracy, teacher may chalk out the monthly, weekly, and daily schedule. Thirdly, the environment of the classroom should be such that it is attractive and welcoming to every child, well equipped with age and developmentally appropriate variety of books and manipulatives; Further, there should be provision of sufficient time for children to practice each concept/skill, and continuous observation of how children are using the materials. b. Planning Activities: Prior planning and thoughtfully planned pedagogies to handle variations in early learning, work quite well. Teachers can plan these activities in a phased manner, proceeding from simple to complex, using the process indicators that would help in achieving the learning outcomes. Gradually, teachers should support the children's learning by progressively introducing new skills and knowledge. The kind of teaching instructions in the form of open-ended questions would help in knowing children and challenge children at the same time. Every teacher should know how to plan, execute, observe, and assess children's learning in foundational literacy and numeracy. Teachers must not hesitate to learn from one another and through exchange of ideas with cluster/block and other schools. c. Teachers to provide Enabling Environment: Teachers need to know the developmental characteristics of children, their individual learning styles and thereafter modify their teaching strategies. Pedagogical processes should consist of indigenous toys, materials, literacy, and mathematics related games that facilitate overall development. For example, movement games help to teach Guidelines for Implementation a spatial sense, body coordination, sense of rhythm, vocabulary development and so on. A good teacher would be friendly and interactive with all her/his learners, such as ask questions regarding their creation/activity individually to help them extend their thinking and encourage conversation. She should not be intrusive or directive in her approach, rather allow for learner's initiative and imagination to flourish and encourage them to express freely. Most",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "importantly, the teacher must be encouraging and appreciative of each learner's efforts to give each learner a sense of confidence and boost their self-esteem. This would motivate them to come to school regularly and draw their attention towards learning. d. Multiple Opportunities for Learning: Lots of opportunities for use of expressive and receptive language skills should be provided. Children need to be given opportunities to interact with adults and other children, to express themselves creatively and to communicate confidently. The small group interactions, read aloud, construction tasks in small groups, solving big puzzles in pairs are some of the proven strategies to improve communication skills, and increase the self -esteem of learners. These skills would help children to communicate ideas effectively, grasp the verbal information, listen to others, understand what other says, and thus develop and maintain relationship with their peers and adults. The read aloud and picture reading provide opportunities for learning new words, critical thinking skills etc. Asking questions are some of the especially important strategies to strengthen language and early literacy. When children engage in meaningful literacy activities with purposeful instruction, they develop listening, speaking, reading, and writing skills that enable them to be effective communicators. Similarly, to enhance mathematical thinking and scientific temper right from the beginning there should be ample opportunities and a variety of experiences /activities for developing skills related to problem-solving, critical thinking, reasoning, and analysing. e. Managing Varying Abilities: For preschool and Balvatika, the younger age group of children with emerging abilities can be engaged in free play, while the teacher conducts the guided activities with the older age group of children with higher abilities. After a period of minutes, the teacher can conduct guided activities for the younger age group with emerging abilities while the older age group children are engaged in free play/activities. Thus, the teacher will be able to manage the varying abilities and age groups through development appropriate activities. Here it is to be noted that this grouping is not NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy meant for any kind of discrimination among children, but to facilitate learning and guide learners for smooth progress in literacy and numeracy learning. Another example is taking advantage of group mealtime or small group play time where all children sit together and enjoy their lunch/play together. The teacher should utilise this time by encouraging good meal",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "habits and work habits among learners, like eating food properly, how food tastes, throwing the fruit peels in the bin, putting away materials after playing, not dirtying the room, etc. f. Areas to be focused upon while planning activities: All children from the age of 3 to 9 years are required to build on all their literacy and numeracy experiences and exposure to enhance their communication and mathematical process skills so that they can describe their experiences more effectively. It also needs to be ensured that all learners can receive and communicate information and develop higher order skills critical and creative thinking. This would help them to learn to read and write with comprehension that eventually enable them to solve the appropriate math problems using the process skills. This is the reason foundational literacy and numeracy must be seen as continuum from pre-school to class 3. The following should be considered while planning and promoting the specific pedagogical practices for FLN: Model literate and mathematic behaviour Intentional and guided practices/activities Listing of Process indicators for timely checks Continuous review and reflection by the teacher On the spot guidance by the educator/specialist Use of varied strategies for children of different abilities and interests. Use of varied indigenous toys, materials, and other resources to support the classroom plans and activities. Making good use of time and integrate FLN in daily schedules. 5.2 Learning Enhancement Programme a. Learning Enhancement Programme: To enhance the quality of education Learning Enhancement Programme (LEP) has Guidelines for Implementation a been adopted by different States and UTs. The programme, supported under Samagra Shiksha, aims at bridging the learning gaps of students in government primary schools; remedial teaching after identifying students based on an assessment and post assessment to be conducted to see outcomes; activities under Padhe Bharat Badhe Bharat (PBBB) for early grades; developing modules and exemplar material for teaching-learning, teacher training and continuous and comprehensive evaluation; interventions for enhancement of Learning Outcomes especially for students in areas having lower performance under the National Achievement Survey etc. b. LEP Guidelines-COVID- Response: During Covid- pandemic situation, National Council of Education Research and Training (NCERT) framed 'Students' Learning Enhancement Guidelines' for students with or without the digital resources to continue learning while schools may be closed, especially for an indefinite period to prevent the spread of the coronavirus. These guidelines seek to help children who cannot access online learning as",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "well, recommending ways to learn at home. The Learning Enhancement Programme (LEP) guidelines- emphasize upon the community working closely with the school to get learning materials such as workbooks, worksheets, etc. delivered at the doorsteps of children by teachers and volunteers. suggest teaching local students by volunteers or teachers by setting up television at the community centre and make children sit while maintaining social distance norms. suggest measures for three types of models i.e., students not having any digital resource; students with limited digital resources; and for students with available digital resources for online education. suggest a continuous learning plan for each child of each class with special reference to their accessibility to resources. Setting up a helpline at a community centre with the help of local body and forming a team of volunteers to help students without access to digital resources are among a few measures listed in the guidelines. The guidelines further recommend orientation of parents to support and participate in the learning of their children. However, these guidelines can be https://ncert.nic.in/pdf/ announcement/Learning_%20Enhancement_Guidelines.pdf NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy of immense value even in the post COVID scenario as they involve the parents, volunteers, peers, and the whole community in facilitating learning of children. 5.2.1 Implementing Learning Enhancement under FLN Teachers need to focus on developing phonological awareness and sound discrimination, and visual perception and visual association that helps children to develop into better readers and writers. Reading story books aloud or book browsing experiences in reading or book areas should be informal and enjoyable with access to a wide range of reading materials, including picture books, children's magazines and graded story books with progressively more and more text being introduced along with pictures. The foundation for mathematical learning or abstract thinking gets laid through play and activity-based approach (including toy-making, art integration, sports integration, storytelling-based learning, ICT integration, group work, role plays, project work in groups, etc.) that are meaningful for every learner. Mathematical thinking involves thinking about objects and their quantitative and spatial relationships without thinking about their specific characteristics or qualities. The objective should be covering each child to develop the desired competencies so there is no need of any remedial teaching in later years. Involve Parents/Guardian or Volunteers to orient parents on conducting activities with children on foundational literacy and numeracy skills for inculcating the habit of reading",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "and basic numeracy in their daily life. For reading comprehension they may be asked to tell a story in their own language, which they have read from a book (story book or language textbook or from magazine or newspaper) or read the wrappers or sign boards. For basic calculation, they may be asked to make a list of items purchased for use at home in last two days and calculate total expenditure incurred for that or recognise numbers on wrappers, signboards, vehicles and try to add and subtract them on fingers/mentally. Parents/Volunteers may be guided on creating cards using hard paper/cardboards/waste cartoons for children, by making diagrammatic representation of numbers or alphabets or words on it. Through play way method, they can create interest in children to learn the same. School needs to collect some interesting picture and story books from the community or parents of older children, which may be distributed to Guidelines for Implementation a parents offoundational learners for developing interest and habit of reading. With children of classes 1 and 2, use of fingers, pebbles, pulses, or other objects may be promoted for doing basic addition and subtraction, and classification. First generation learners may be supported similarly through teachers, volunteers, community members and their peers through various activities at a community level. 5.3 Emphasis on Child Centred Pedagogy The whole planning of foundational literacy and numeracy should be child/learner centred and based on learner's needs and interests. The activities should be planned in such a manner that provides ample opportunities to ALL children a chance to express themselves and the teachers should accordingly modify their practices. Teachers must be sensitive to each child's needs and take immediate review of her/his teaching practices. The goal of teacher is to motivate each child towards reading, writing and early mathematics by creating harmonious environment where emphasis is given to engage ALL children. The activities should be contextually relevant (in local context) and planned progressively from simple too complex to allow for challenge and yet be achievable for most learners with same effort, while also catering to individual needs. Sometimes learners show disinterest or reluctance to read or write, a good teacher should keep some transitional activities handy and ready with them to provide to children in such cases. For example, moving periodically during the day, around the classroom and playing some movement games would help children to focus on planned",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "activity. The teacher should establish positive rapport with ALL learners. The pedagogical practices need to include plenty of opportunities for small and large group interaction among children as this would also provide for collaborative process. To enhance foundational literacy and numeracy, learner centred pedagogy will encourage children to use language to listen, speak, read, and write. The learner centred classroom emphasizes on interactive classroom that includes authentic, appropriate, and accessible toys and materials. NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy Teachers need to Demonstrate equal and appropriate expectations from boys and girls by providing equal attention, respect, and equal learning opportunities in an inclusive environment. Select books, pictures, posters, toys/materials, and other activities free of gender bias. Not use gender biased statements while talking to the learners or giving instructions in the classrooms Select such stories, rhymes/songs, activities, and facilitation aids that depict girls and boys, including some with special needs, in the same roles as men and women in all professions. Encourage learners to follow their interest that enables them to develop skills of self regulation, perseverance on task and good work habits. Use toy-based pedagogy and experiential learning. Emphasis to be given on self making of toys by children with no/low-cost material easily available in the surroundings. Toys owned by children can be pooled for communication skills, where each child brings a toy to school and then talks about it or writes about it, etc. 5.4 Linkages Across FLY- 1 and FLY-6 (Ages 3-9 years) a. The foundational literacy and numeracy activities should be linked to the learning outcomes and be spiralling and progressive in nature that would eventually help the teachers to see the overall progress of children in each component and sub component. b. At every stage, the basic learning principles will be followed namely- moving from familiar to unfamiliar, simple to complex and from concrete to abstract as this would help the learners become more confident. c. Teachers should be skilled in using assessment techniques that are a part of the teaching learning processes; for example, how each child is responding to the print and numeracy rich environment, whether the child explores books, how the child is handling books, hows/he is exploring and managing the early attempts of writing etc. Are they able to construct with blocks and use manipulatives in a variety of ways, Guidelines for Implementation a what",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "they talk and how do they interact, what kind of mathematical language they use as they get engaged in exploring materials and manipulatives both indoors and outdoors, are some other examples? Assessment must be done with the purpose of recognising and encouraging strengths (how they are progressing in each of the skills/concepts), identifying areas which need additional support (such as sound discrimination activities), and addressing learning/developmental gaps (any kind of developmental delay). d. Various tools and techniques like anecdotal records, check list, portfolio and interactions with other children can be used for recording observations and assessment. Assessment should be in-built and a part of the pedagogical practices and non-competitive. 5.5 Content Development including Digital Content to support Teachers a. Quality of teaching and learning are determined by the teachers: Well trained teachers with requisite knowledge, skills and commitment can broaden the learning process. A well-designed content including Digital content helps support teachers during this process. Presently, the whole world is heading towards digitization and quickly learning new things by using new technologies. But these new technologies are placing more demands on teachers to learn how to develop and use them in their teaching learning processes in more creative and productive ways. Let us understand the process of development of content including Digital content to help teachers build their capacities in the development and use of content. b. Development of good content does not happen by chance: It takes extensive planning and preparation. Understanding of ways, how students learn, can help teacher develop an effective content. Before designing any content, course preparation or the lesson plan, the teacher must think about the following key questions: What do I want my students to learn? How do I measure my students' learning? How will my students learn? Based on these questions, teachers must determine the best means for transacting the NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy content and meeting the learning objectives defined for the content. This can be done through the lesson plan. It is the teacher's roadmap to transact the content effectively in the class. Accordingly, learning activities and strategies can be designed. The teachers first define learning objectives, then determine the assessment process and finally plan instructional strategies. 0 Understanding the Developing a realistic .V.,, cz2 .. learning outcomes timeline r -c m<n learning activities and cno Ci::: CL. pedagogies closure 0 ;;ic CL.",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Z-c Ci::: 0 Planning to sequence the Starting Lesson plan with Ov, lesson in an engaging and students to help them LL V) meaningful way engage v,W CL. J \"\"C ;;ic .. C:! w Planning to assess student Reflection on lesson z V) c. An ample range of digital materials and e-content with educational implication are accessible online: DIKSHA is a one nation one digital platform where such resources are easily available and accessible along with proper classification. Such materials offer both teachers and students a better interactivity and social collaboration. Teachers should access these resources to learn, relearn and unlearn as often as possible. However, teachers should be encouraged to become not only consumers but also creators of e-content as per their local context and experiences as well as needs of the learners, especially for foundational levels. E content can be created in a variety of ways by using variety of tools and software. There are various software packages, which can be used easily by the beginners fore content development. 5.6 Teaching Learning Materials (in Local Context) a. Local toys, games and other educational play materials should be kept in easily accessible open shelves for children to explore. These open shelves should be duly labelled with print, numbers and pictures that would help children to easily take and keep back the toys and play materials. The activity or interest areas such as reading or book area/mini library in each classroom, math/manipulative Guidelines for Implementation a area, writing area, construction/block building area should be well equipped with local contextual literacy and numeracy materials. Rather every other area such as circle time area, attendance area and other play areas should be designed to promote literacy and numeracy in a meaningful way so that children's attention can be drawn to this print and numeracy rich environment and learning can be absorbed in a joyful manner. b. There should be enough materials to display which are made by the local/ regional community or parents or by children themselves so that consciously or unconsciously children are sensitized about their local culture and traditional knowledge. Children can be encouraged to develop and play with their own board games with pictures, numbers and text which help them relate pictures to text, identify text and numbers and get exposure to addition (forward steps) and subtraction (backward steps) etc. The toys and educational play materials should be acquired/developed",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "according to the developmental concepts/skills and teachers should plan their monthly/weekly and daily plans using the indigenous toys and materials. Asha, Seema and Raju were three of the students in Ms. Maria's class. It was an English class and Ms. Maria narrated \"The Lion and The Mouse\" story. Then she went on to explain how no matter how powerful we might be, the smallest of persons can be of immense importance and help to us. It was usual for teachers to then ask the boring question \"What's the moral of the story\" and we all knew the right answer. Instead, she turns to Asha and says \"What comes to your mind when you hear the word small?\" Asha was suddenly attentive and thought for a moment. Then she said \"not taking much space\". Then she turned to Seema and said \"Do you agree? What do you think of that? Does small mean something else in a different context?\" Seema said, \"Sometimes I feel small when someone has hurt me\". She then asked the class \"So we see small describes both feeling and things - how interesting. Would you say feeling or being small is a good thing?\" We thought about that for a while and then Raju said \"I can be a good thing. Being small for a purposeless conspicuous\" (ugh... where did he learn that word \"conspicuous\" ... such a showoff). Asha countered saying \"It's never good to be small\". By then it was time for the class bell. We left with words ringing in our heads and a new way of seeing all things small and beautiful. NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy Useful Resources Students Learning Enhancement Guidelines, NCERT https://ncert.nic.in/pdf/announcement/Learning- %20Enhancement- Guidelines.pdf Continuous and Comprehensive Evaluation Guidelines, 2019, NCERT https://ncert.nic.in/pdf/announcement/CCE-Guidelines.pdf Guidelines for library grant and promoting reading in schools, 2020, MoE https:// dsel.education.gov.in/dsel/sites/default/fi!es/update/1ib_grants. pdf Guidelines for Implementation Chapter 6 AR A Guidelines for Implementation a After the dictation they put down their slates and I went through their writing. I found many words misspelt. Quite a few of them were unable to write conjunct consonants. Their handwriting also left much to be desired. I had made no corrections on their slates. These I returned after I had gone through them. The boys began to clamour, \"How many mistakes have I made?\" asked some, while others wanted me to give them ranks.",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "One of the boys said,\" Now Laxmiram bhai will also teach us as other teachers do and give us ranks.\" \"I am going to do nothing of the sort,\" I said. \"You all know how to write fairly well. Try again tomorrow. Gradually you will learn to write well. And practice will help you to write well -I am sure of that. Anyway, what's the point of marking your mistakes?\" \"But what about ranks?\" asked one. \"Do I give you ranks when I tell you a story?\" \"No.\" \"Do we have ranks when we play games?\" \"No.\" \"Some of you are tall, while others are short; does that mean ranks?\" \"No.\" \"Some of you are fat, some quite lean; does it imply ranks?\" \"Not at all.\" \"Some are rich, some are poor; does the school give ranks according to whether you are rich or poor?\" \"No.\" \"Then we just don't want the rank system at all. A person who can sing may sing our poems. He may try to recall the words when he forgets them. A person who does not know a game may observe others' and learn; and one who is good at a game may play for the pleasure of it. A child with a good handwriting may serve as a model to others who would like to improve their own. Those who are good at doing things can always teach others who are not so good. That's all!\" - Excerpt from 'DIVASWAPNA' by Gijubhai Badheka NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy 6.1 Understanding Assessments Assessment involves the gathering of information from all possible sources, regarding knowledge, skill, attitude, ability, and beliefs of the children, document the same and use this data to make informed instructional decisions, refine or restructure processes and ultimately improve the Children' learning. Assessment serves several related important intentions, including informing the teachers as to how to plan learning experiences, identify areas of learning and development where children may need support or extension, to quantify the gain in achievement of learning outcomes. Assessment serves the best interests of the child when all stakeholders, including the parents/care givers, teachers, administrators as well as the makers are involved in the process of understanding the data obtained through assessment. This involvement and collaboration are key ingredients to support children' learning and vital for system improvement. Assessment is important in all",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "stages of learning but more so during foundational learning. 6.2 Assessment during Foundational Years The period of foundational learning is a crucial phase for the development of intellect, ability, physical growth, mental maturity and values. The quality of education in this phase determines all future achievements and accomplishments. The nations known for excellence in school education like Finland and Singapore invest intensively in this stage. The primary purpose of assessment is to support and guide each child's learning from FYL- l to FYL-6 (age group of 3 to 9 years). This is to support the teachers across the foundational stage to gather and share appropriate information about their children and pay specific attention to the traits that might lead to early signs of disabilities. Learning at the foundational years happen at varying rates and it entirely varies from child to child. It even varies across different developmental areas/ subjects and it depends upon how an individual child responds and functions because the learning at this stage is majorly influenced by many social and cultural contexts. Assessing learning progress of children helps to identify children's strengths, needs, interests and preferences. Guidelines for Implementation a Assessment is vital to track children's progress in a continuous and comprehensive manner using multiple techniques of assessment. Assessment aims at early identification of learning gaps at each foundational stage i.e., at FYL-1, FYL-2, FYL-3, FYL-4, FYL-5, and FYL-6 including children with special needs so that there can be possibilities of early intervention through referral to specialists. Assessment at this stage should essentially be designed to encourage each child's efforts to explore, observe and learn. The results of assessment are used for purposes of not only conveying about 'what has been learned' but also 'what factors had restricted the learning' and the 'altered strategies that would improve learning'. Assessment of child's learning should not be restricted to the four walls of the school but should permeate to their parents/ care givers, and to the community at large. The fundamental purpose of assessment is to use the data obtained through different sources to support, guide, and maximize each child's potentialities. The transaction of knowledge and the assessment must go side by side. A holistic and purposive assessment is therefore vital to track children's progress by using different techniques to help the stakeholders to: identify the child's strengths, needs, interests and preferences. potentiate child's performance and scaffold it through",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "interventions. collaborate to solve issues and areas of concerns. contribute to early identification of learning gaps and learning difficulties. Though the rate of learning (and hence development) varies from child to child, the sequence of the process of learning remains similar. The ability to learn and the pace of this learning are affected by factors like health, nutrition, sense of safety and levels of love and affection, involvement and participation of the family, school, and the community. Continuous interaction and collaborative effort are required with the parents/care givers. Involvement of the parents is vital to achieve maximum learning and development of competencies in the child. Enrolment into a school system is certainly not the end-all of the parent's responsibility towards their child's education. They must actively engage themselves in encouraging the child to learn from their home surroundings as well as outdoor experiences. Parents/care givers need to monitor the child's progress, growth, and development in all spheres, taking active interest and participation, celebrate their success and form a support system in events of temporary setback or when the going becomes stormy. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy The Three Goals and Assessment The foundational years of education has three developmental goals as discussed in earlier chapters that comprises of 'prime learning areas' such as physical and motor development, socio-emotional development, language and literacy, cognitive development (mathematical understanding and numeracy as well as understanding the world), spiritual and moral development, art and aesthetic development which are interrelated and interdependent. Development in these learning areas make child competent to deal with complex life situations and all these areas have been subsumed into three major goals which are briefly discussed here: - These' prime learning areas' are considered as different subjects as the child moves to early primary grades i.e., class-1 or at the FY-4,5 and 6 stage. However, it must be noted that all these six stages should be continuum. All these areas are intimately intertwined with each other and should be assessed to support the process of learning at this stage. The teaching learning strategies need to be planned around these three goals and these goals support the foundational years of learning of ALL children. These learning areas are mentioned above under the three goals. The system is comprehensive, providing behaviors to observe, a systematic way to collect anecdotal remarks, and a means to draw",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "conclusions about the children's performance to plan instruction. Testing children or grading their work should not be encouraged during foundational learning. The FLN curriculum promotes the idea of encouraging children and helping them to develop a positive self-image, gain confidence in their own abilities and individual progress at one's own pace. Also, children do not have to repeat the class, regardless of their attainment levels. Assessment is the process which is integrated with the teaching-learning processes and principally aimed at empowering the teacher to see the individual child as well as collective impact of the classroom transactions and attaining the desired leaning outcomes as intended in the in the three developmental goals mentioned in earlier chapters. Assessment during the foundational stage can be broadly categorized into two major areas, namely: a. School Based Assessment (SBA) by the teachers: for assessment of the individual child's progress. b. Large-scale achievement survey: for assessment of the processes and functioning of the educational systems (such as NAS, SAS, and Third-Party Assessments). Guidelines for Implementation a 6.3 School Based Assessment In School Based Assessment13 (SBA), the teacher herself devises the assessment tasks along with the children to evidence the learning continuum (as opposed to standardized tests where at the state/national level, where the assessment is designed centrally). School-Based Assessment (SBA) is principally aimed to see the individual as well as collective impact of the classroom transactions, and experiences at home in attaining the desired leaning outcomes as intended in the curriculum. The school-based assessment helps monitor the quality of education in a decentralized manner. Standardized tests administered by the state/national level cannot be a replacement for SBA SBA is all about assessing the quality at the micro level through assessment tasks created by the class teacher in accordance with the requirements of the class/child. SBA system of assessments, done by the teachers, works more in favour of the child than the rigours of sitting for one-time exams. In SBA, the child has an equal partnership in the assessment process and involves use of techniques like observation by the teacher, maintenance of individual child's portfolio to document progress, peer assessment and self-assessment. The success of SBA is dependent on the capacity of the teachers and degree of autonomy provided to the teacher to assess her class in creative ways. Therefore, in SBA, the teacher is the primary facilitator and emphasis is on empowering the teachers by",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "providing complete autonomy to them to assess the child's performances, aptitude, attitude interest and achievements. 6.4 School Based Assessment in Foundational Learning School Based Assessment at the foundational stage should be stress-free and largely through qualitative observation based on performance of the child in a multitude of experiences and activities. It should be through day-to-day observation and documentation of stated outcomes achieved as well as children's development in terms of their health and nutrition status, their participation and involvement in learning experiences, artwork, games and exercises, music and movement etc. School Based Assessment Module (SBS) https://itpd.ncert.gov.in/course/view.php?id=&section=5 NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy including their behaviour in classroom and outside. Assessment at this stage is done to recognize and encourage strengths, identifying areas that need additional support, and addressing learning/developmentalgaps. Various tools and techniques like anecdotal records, checklist, portfolio, and interactions (through a holistic -degree assessment with teacher, peers, family, and friends) can be used for assessment. Assessments, when designed properly, can support, and not just measure, children' learning, building their competencies and granting them the feedback they need. Therefore, the learning assessment during the foundational years cannot be limited to a paper pencil test at the end of the academic year. The assessments done should necessarily be communicated to the parents/ care givers at appropriate pre-determined intervals. Also, it is important to remember that the learners bring their own individual approach, abilities, and interests to the learning situation. In SBA the teacher familiarizes herself with the individual child's culture, language, learning preferences, family background, and socioeconomic level and design assessments based on the same. Understanding the context in which the child grows and develops has an important impact on learning and helps design assessment tasks free from cultural biases. The learning outcomes outlined in the Annexure-1 for Foundational year level l to 6 (FYL l to L6) are arranged in a spiral and progressive continuum to enable teachers to track the progress of these learning outcomes. However there is also a need to assess progress of learning at different levels of a learning outcome within a class. The fact, that all children learn on their own pace and style, also need to be kept in view while assessing children on each of the learning outcomes. They may show their progress at different levels. Experiences of working with children show that children often show learning",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "progress at the following levels as given in the table: Level 1 Level II Level Ill Level IV Trying to achieve the learning outcome with teachers' support in the given time frame Achieves the learning outcome with teachers' support in the given time frame Achieves the learning outcomes on her/his own Achieves the learning outcomes and helps and supports others to achieve the learning outcomes and require more challenging tasks. There may be 5- % of children who need support and teachers need to take this fact in cognizance and plan intervention to support these children accordingly. These children may belong to different socio-economic contexts including linguistic background. Also, there may be gifted children in the same class, for whom teachers need to plan more challenging tasks. Guidelines for Implementation a For more clarification, assessment of learning outcomes based on exemplar activities are given below: HWl .8-LO- Makes choices and expresses preferences. Exemplar Activity- Painting Level 1 Level Level Ill Level IV Child's asks teacher Child gives his/her Child picks up the Child completes about which colour to preferences of colours favourite colors and his/her pointing and be used in the picture to teacher and asks completes her/her helps his/her peer in already created. (Teacher will discuss for teachers' approval. (Teacher will pointing. (Teacher will choosing colours with the permission of with child about his/her liking about encourage child further choose specific encourage child to explore more shades teacher. (While appreciating, colours and colour and point) of colours and to teacher will encourage encourage the child to support other children) child to explore more choose the colour on shades of colours and his/her own from the to support other colour collection) children) IL, 1.3b-LO- Identifies the missing parts of familiar picture. Exemplar Activity- Observing* the picture of an elephant with missing parts, name different parts in the picture and finding the missing part. Level 1 Level II Level Ill Level IV Child observes the picture and name some ports and points out one missing port without naming it. (Teacher will prompt the child to tell the name of the missing port by giving some clues and encourage for finding out other missing ports) Child observes the picture and name some ports and points the one missing port using active vocabulary. (Teacher will appreciate and prompt the child giving some clues for finding out other missing ports) Child observes the picture",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "and name most of the ports and points out all the ports using active vocabulary. (Teacher will appreciate and encourage child to support other children) Child observes and names out all the visible ports and missing ports and helps his/her peers in finding out the missing ports giving them clues with the permission of teacher. (Teacher will appreciate and encourage child to keep it up) *For children with visual impairment, Embossed/textured pictures may be used. Levels of performance: (i) level I: needs lots of support (ii) Level II: able to do with support (iii) Level Ill: Age appropriate and (iv) Level IV: more than expected (Advanced) Continuous and Comprehensive Evaluation Guidelines, NCERT https://ncert.nic.in/pd//announcement/CCE-Guidelines.pdf NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy 6.5 School Based Assessment in Foundational years under 3 Goals The foundational learning has primary areas of focus, which are intimately intertwined with each other and should be assessed by the teacher through SBA to support the process of development during foundational years. These prime learning areas are subsumed in the three developmental goals offoundational learning described in the previous chapters: Goal 1: Children Maintain Good Health and Wellbeing This goal continues to provide experience for health and wellbeing, physical and motor development socio emotional development, nutrition, hygienic practices and safety from FYl -FY6. Assessment under this goal needs to keep in view the following: Physical and motor development is an important area consists of development of gross motor skills (jumping, hopping, etc.) and fine motor skills (drawing, colouring, threading beads, etc.), which affect educational advancement in the child. This must be ensured by the parent and the school system. Exercises and games must be designed and encouraged that give strength, coordination, flexibility, and endurance. Enhancement of gross and fine motor skills is essential for the child's ability to work on activities demanding eye-hand coordination. Thus, physical ability becomes a vital part of the child's assessment in the early years. Aspects of hygiene to maintain good health include observation of practices and habits such as washing hands before and after the meal, covering mouth while. coughing, throwing the litter in the dustbin, taking bath regularly, etc. Keeping objects, toys, etc. in an organised manner - Children follow what they see, so the teacher needs to work with them to keep things at the right place, then only it will become a habit with the child.",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Cleanliness is a value which is 'caught' and cannot be 'taught'. If a child watches mother taking her shoes off on returning from work, and keeping it properly before entering the room, the child learns to do so. Teacher can observe the child's habits in ensuring that they keep their belongings back to the appropriate place. Social and emotional progress is based on the experiences that the children gather, reactions to pleasant and unpleasant stimuli through verbal and non-verbal Guidelines for Implementation a expressions, learning to regulate their emotions, and the initiation of relationships with others. These processes of regulating emotions and consequent behaviour as a part of interaction and communication need to be documented as part of the progress card. Gregariousness (enjoying the company of others) gets developed around the age of six, when children are ready to spend time with their peer and in groups. Using the techniques of peer assessment and self-assessment provides great insights into the child's world and their personal, social, collaborative, and emotional development. All forms of creativity, art and design are an integral part of foundational learning, such as, poetry, rhymes, songs, music (vocal or percussion/string /wind instruments), drawing and painting, puppetry, clay modelling, papercraft, toy making, choreography, etc. Every child must be exposed to various art forms and the teacher must actively watch for interest, ability, aptitude, imagination and creativity, expression and correlation with outer environment and inner values, within the child. The same must be noted, necessary encouragement and opportunity must be provided by the school system as well as through communicating the same to the parents. It must form an important and integral part of the child's assessment and final sharing. For example, the use of paper toy-making or paper folding activities for assessing the child, helps to understand as to whether the child can follow the sequences and imitate the behaviour demonstrated by the teacher. The finesse of the artwork produced and the ability to perceive the details are some of the assessment criteria which can be demonstrated by the paper folding activities. Origami is the process of producing an aesthetically designed finished product by following sequencing and eye hand coordination. It introduces the child to the power of imagination coupled with the dexterity of the hand to transform a simple raw product into an object of delight, of use and beauty. Goal 2: Children Become Effective Communicators Once",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "the foundations of language and literacy are laid during the preschool stage (3-6 years), this goal leads to subject- first/second language for example Hindi/state language/English. Following need to be considered under this goal for assessment: NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy The mother tongue of the child must be the Language of communication (if not the medium of instruction) with the child in school in the formative years, so that the child does not suffer any confusion in understanding the transactions and is able to grow with free expression. The ability to communicate must be developed both as the initiator as well as the receiver. This means that the child may be assessed in perceiving the need to communicate, forming the idea to be communicated, use of the appropriate words, verbalize them in a manner that is understandable and substantiate the communication with appropriate facial expression and body language and finally receive verbal and non-verbal feedback from the receiver. Three important aspects of communication are listening, to empathise and the need to collaborate. Assessment tasks may be designed to gauge these aspects along with other aspects in holistic manner. Giving importance to non-verbal communication, the child may be exposed to the different 'bhavas' (emotions) and the 'mudras' (gestures), which were part of our rich Indian culture. Assessment tasks may be developed to identify the bhavas and the mudras and further ask the child to elicit situations in which the bhavas and mudras are observed. Sign language may also be used for this purpose. The development of a 'sense of humour' is an important area connected to the development of language and communication, which should be encouraged so that it develops gradually as the child grows. The importance of foundational literacy has been established beyond any debate to be an important contributor to future success in academics, decreased failure rate, better overall scholastic achievements, and generally greater adult life success. The developmentally appropriate exposure to language and foundational literacy at this stage has a direct correlation to the future ability to read. Literacy assessment is all about whether the child can read fluently with comprehension. The reading text may be a road sign, a poster, grocery rapper, train schedule given in the platform etc. For example, the child may be asked to read a poster as shown below, followed by asking simple sentences relevant to",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "the poster such as, 'what does the poster tells us to do?'. Guidelines for Implementation a The assessment rubric may be developed by the teacher including three four levels as per the needs: Beginner- Whether the child can locate the information given in the text, Progressing - The child can interpret the information located in his/her own words, Proficient - The child can value the information as being useful or not so useful. Advanced - Whether the child can use the information. These four levels of assessment of reading comprehension help the teacher to design the interventions targeting the level which requires focus. Goal 3: Children become involved learners and connect with their immediate environment Following need to be kept in view for assessment under this goal: Mathematics forms the foundation for the expansion of essential aptitudes in an individual and this is especially vital in today's rapidly progressing digital world. Mathematics can introduce in the foundational years of education through exposure to solve puzzles, develop the concept of distances, weights and time, three dimensional cognizance in forms of geometry and sizes and shapes. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy Assessment of the child must essentially include the ability to make sense out of numbers, prepare groups, shapes, patterns, understand direction, distances, weight, and time. Learning numeracy is not limited to counting numbers, rather it entails learning the language of mathematicsand use of mathematics by the child to relate to her/his environment. It is not about following algorithms to arrive at a solution, but it is more of grouping and regrouping to perceive the things better. An example of an assessment task that tries to analyse mathematical thinking capabilities in a child is given below. In this activity, instead of just asking children to count the stars and colour them, the child can be prompted to make groups of 2, 3 and 4 and colour them differently on different papers and observe how many groups of 2,3 and 4 are formed and tosee the relationships between them. This activity of grouping and regrouping enhances the analytical ability of the child. Thus, it may be emphasised that learning numeracy is not just understanding of continuous mathematics and applying algorithms but also about discrete mathematics and using mathematics to make a sense of the world around us, i.e., mathematical thinking. Assessment should support the learning of",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "mathematics and furnish useful information to both teachers and students. Some of the suggestions for undertaking assessments in foundational years have been shared below: Multiplicity of Assessment Tests and Techniques- India is a diverse nation, so 'singular' test cannot be used to assess the numeric skills of all the students of a nation. So, multiple assessment tests need to be created according to the socio cultural, economic, geographical, and linguistic demands of the areas. Further, the assessment techniques also need to be innovative and should try to explore the attainment of learning outcomes by the students in their classrooms. However, students must not feel the pressure of assessment. Hence, it should be undertaken as a joyful activity in class, preferably through collaboration or group work. Development of Model Assessment Test based on Learning Outcomes- The assessment tests should be subjective and according to the learning level of children of the classes. But this subjectivity should not malign the aim of attainment of foundational numeracy among the learners. So, the learning outcomes which have been developed by the NCERT should be in the prime focus while developing these assessment tests, so that parity can be maintained in the tests designed for two different classes. Guidelines for Implementation a Development of Question Bank- The organizations like NCERT and SCERTs can also develop a pool of questions related to varied aspects of foundational numeracy for the students of different age group. The learning outcomes of each class should be considered while developing the questions for the question bank. These banks can be used as quizzes addressed to groups in class, or children can be asked to work in groups to devise quizzes for other groups. Creation of Audio-Visual tools for Assessment- Some audio-visual tests can also be developed to understand and assess the attainment of numeracy and mathematical skills among the learners. They may be appropriated by the different state governments as per their needs. These audio-visual tools can be created in different languages and in different states, so that these can be more appropriate for assessing the learning outcomes of students of different states which come from different socio-cultural, economic, and linguistic backgrounds. Portfolios: Portfolio is an anecdotal record of child's work during teaching-learning. A portfolio gives holistic idea about child's progress, learning strengths of the child and learning gaps vis-a-vis learning outcomes. A portfolio also provides necessary inputs to teacher of",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "new class (if any) about child's progress and learning process in earlier classes. Portfolios need to be developed by the child in consultation with the teacher and can also be used for peer and self- assessment. Take care that portfolio should not only have record of good work done by the child, but it is record of all noteworthy activities including, assignments, worksheets, projects, record of observations in the classroom and oral interaction with child in the form of teacher's note etc. Assessment through Rubrics Some examples of rubrics15 for evaluating tasks for foundational numeracy are given below. These may include descriptive details of the work, which depend on the feasibility of users' available time, nature of task, etc. For example, if children will use them, then their abilities need to be taken care of while creating and using them. Rubrics is on important tool forCCE ond SBA. Rubrics should be developed by the respective class teacher with participation from students. They should be written in such way that it is easily understood by teachers, children, and parents. NIPUN BHARAT: Notional Initiative for Proficiency in Reading with Understanding and Numeracy Criteria Level I Level II Level Ill Identification of shapes Identifies a given shape with the same/ similar shapes of the familiar objects (given /existing around) after some attempts Identifies a given shape with the same/similar shapes of the familiar objects (given/existing around) Identifies a given shape with the same/ similar shapes seen before but are not around Naming shapes and the features Able to generalise the features of a shape to name it informally after some attempts but not formally Able to generalise the features of a shape to name it informally and formally Able to generalise the features of a shape to name it informally and formally, and cites different examples Naming shapes and the features Able to draw but unable to name a given shape from Different Perspectives Able to draw and name a given shape from different perspectives Able to draw, name and explain a given shape from Different Perspectives Imagination/ Creativity Imitates others/takes clues and attempts to create figures /objects through drawing/art and craft Creates figures/objects through drawing/art and Craft Independently Gives novel ideas and creates innovative figures/objects through drawing/art and Craft Ability to interact with the immediate surroundings as well as to know and comprehend about the world at large constitutes a large part",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "of child's development. Adequate opportunity must be provided to the children to explore the immediate physical environment, the residents, flora and fauna, people, places of importance and interest (their need, importance, and utility), the available facility including technology (their need and utility) in the foundational years. Children can learn about their family history by talking to their parents, and grandparents. They can be encouraged to take care ofa plant or animal and to study their growth. The teacher must, through observation, interaction, and projects/tasks, assess the level of interest and engagement of a child in comprehending and understanding the world around him/her. Guidelines for Implementation a Assessing through story telling is a useful way by which the teacher can facilitate the understanding of the world around them. In addition to asking open ended questions to children, they may be encouraged to frame and ask questions. Assessment rubric could be designed to understand the level and the range of questions being asked by the child. Children can also be encouraged to build stories around their toys based on their interaction with their surroundings and society Children's participation in class Make activities and learning tasks more participatory in nature keeping in view of varied needs of children. Encourage children to participate in classroom activities through asking questions and framing of problems. Allow freedom of mobility to children in class while working in groups and reading from reading corner. Encourage children to develop many informal strategies in dealing with problems related to numbers and measurement. Opportunity to respond, discuss and share readings and books. 6.6 School-Based Assessment: Tools and Techniques (illustrative) 6.6.1 Use of Observation a. An important part of understanding children's learning is to observe what engages them. 'Observation' is therefore, one of the important techniques of assessment during foundational learning. b. Opportunities need to be created wherein while playing the child can express their potentialities, because play-way method is the suggested pedagogy during the foundational learning. These play situations can be facilitated in the classroom and even at home. Observations may be done to note, 'With whom do they like to play?', 'How do they play?', 'How well do they communicate?', 'Which activities engage them?' etc. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy c. Interest is an excellent motivator for children. When children are engaged in an activity or experience that is absorbing, they are more",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "likely to learn. Another pertinent question to ask is: 'In which situation do children learn best?' This will be different for different children. Each child will have a preferred way to explore their world; it might be in a group, along with few other children, in the presence of an adult; or on their own. d. Through observation teachers and care givers become aware of individual children's likings, which is a precursor for learning to happen. 6.6.2 Self-Assessment and Peer Assessment Assessment should not be limited to paper pencil assessment, particularly in the early years. Teachers need to use self and peer assessment for letting children to assess each other and themselves. This will encourage children to take greater responsibility for their learning, engaging with assessment criteria and reflection of their own performance and that of their peers. Through this, children can learn from their previous mistakes, identify their strengths and weaknesses, and learn to target their learning accordingly. The teacher may use innovative and play-based strategies to do self and peer assessment, such as, by using clay or wooden (eco-friendly) toys. In fact, toys can be used very creatively to assess the personal, social, and emotional development of the child. Teachers need to be incredibly careful with small children while using self and peer assessment not to make these burdensome for children. Exemplar Self and Peer Assessment is given below focusing on the LO-EVS 6. 7: LO-EVS 6.7 Groups objects, birds, animals, features, activities according to differences/ similarities using different senses (e.g., appearance/ place of living/ food/movement/ likes-dislikes/ any other features) using different senses Activity- Children are given a task to group objects based on their shapes. Resources- Triangular, rectangular, circular, and square shaped cardboard pieces and some objects and toys of these shapes such as ink pad, bangles, rings, etc. Guidelines for Implementation a Self- assessment sheet Name.................................. Tick mark the option, that you think is rightforyou- (for small children, teachers may use emojis or smiley faces where children put a mark) l. I grouped the object, and I created new shapes using papers with the help of teacher/friends 2. I mostly grouped all those shapes and objects without any support; only for some objects, I asked for support...................... 3. Icould not understand how to group, so asked teacher .............................. 4. I took very little time to group the shapes and I helped others too. Peer- assessment sheet",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "Name of myfriend .................................. l . Completed the task without help Yes/No 2. Helped others in completing their tasks Yes/No 3. Was asking for support to complete the task Yes/No 4. Finding the task very difficult, so he/she was sitting silently Yes/No. 6.6.3 Use of Portfolios The teachers and children can jointly maintain a portfolio for documenting the progress made by the child. Each portfolio represents a child's journey in learning. Anecdotal The portfolio may be developed as follows: o Decide the learning area(s) to be assessed every week/month (e.g., listening/speaking skill, bonding with books, print awareness, math concepts, problem solving, creativity, peer relationships). o Develop a file folder (portfolio) with each child's name and alogo/code. o Keep adding/collecting the samples of children's work with date and specific learning area (e.g., drawings, paintings, video/ audio tapes, photos, anecdotes). o Relate the children's work/activities to the three developmental goals. o Ensure the work samples showcase the child's efforts. o Share the data and explain the clear picture of each child. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy 6.7 School Based Assessment Compiling Progress through Holistic Progress Report Card (HPC) Assessment of children on all the essential aspects of their growth and development need to be compiled in the form of Holistic Progress Card. The evidence gathered through the activities designed need to culminate in an HPC, which is an individualized and comprehensive reporting of a student's progress. HPC builds on continuous assessment to present a picture of the student's progress across a specific time as opposed to a one-time assessment at the end of a term/semester or school year. The following are some of the attributes of an HPC: a. Provides disaggregated reporting, unlike a single score or letter grade in a subject area. b. Holistic progress reports many unique competencies which are not just academic. c. Multiple learning outcomes are defined (please see Annexure I) to indicate progress of the student in literacy, numeracy and in other areas such as psychomotor skills, environmental awareness, personal hygiene, etc. to enable identification of areas of strength and areas of improvement. d. Painting, drawing, clay-work, toy-making, projects and inquiry-based learning, student portfolios, quizzes, group work, role plays, etc., can be used to assess student progress since indicators/learning outcomes are more comprehensive. e. Informed conversations are held with the teacher, student, and parents for reporting. f. Parent, Peers, and",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "self-assessment can be used to report -degree progress. . 6.8 Large-scale Standardized Assessment 1n Foundational Learning Large-scale assessment data at the National or the International level focuses on the 'System' and describes the educational health of the nation, state, or district. Since it Guidelines for Implementation a involves comparison of the 'systems', the tools and techniques used need to be standardized. The assessment tools commonly used in conducting large scale assessment studies are Multiple Choice Questions (MCQ). The constructed responses are usually avoided to bring in objectivity in the process. Large-scale assessments are a mechanism to gauge how well learning is happening in their state, districts, and blocks. These large-scale assessment studies are carried out by defining the 'assessment ' and with a clear purpose in mind regarding how the assessments study will be used to evaluate the system, to hold it accountable and to define strategies for improving the learning levels. Assessment design and administration are crucial to ensuring the validity and reliability of data generated by such studies. These kinds of surveys are crucial to understand whether the inputs provided are facilitating the learning. In India, the National Achievement Survey conducted in 2017- described the learning levels of the children in grades 3, 5, 8 and l 0. With the focus of 2020 on foundational learning, NAS for foundational learning would be conducted in 2021 to understand the system level preparedness and functioning. Further, a study will be undertaken by NCERT which will be the first large scale assessment & benchmarking study for foundational literacy including oral reading fluency across different languages in India. It is envisioned to be positioned as a subsystem study under the main National Achievement Survey (NAS) l to extrapolate and understand the learning levels vis-a-vis the advancement in the grades. 6.9 Conclusion To conclude, the teachers at the foundational stage need to observe children as they play, work on their task, perform or interact among themselves, it provides them a wealth of information about the children's interests and learning. This treasure of information collected under School based Assessment is used to plan the teaching learning strategies and help to modify the ongoing planning to ensure that it meets the needs of ALL children. Before actual implementation of FLN, there should be appropriate exposure to literacy and numeracy rich environment for the children which encourage interactions to achieve the desired competencies or learning outcomes.",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "However, the data collected through Large Scale Assessment is helpful for assessing the health of the system, i.e., teachers' capacity to implement FLN, parents' involvement, quality of material, etc. Coherence in both the types of assessment will facilitate implementation of FLN mission in smooth manner. Large Scale Assessment will help in reporting the progress on SDGs, but school-based assessment on the part NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy of teachers will help in improving FLN learning outcomes leading towards holistic development of children. Sarah was all of 5 when her parents found that she was not quite keeping up with the class. She could not recite as well, was undisciplined (would not keep things in place in her Montessori class) and was irritated at the slightest loud sound. They were called in and the teacher explained that \"she was behind\" on many development milestones. Mother Shaila was most upset and as she reflected, she thought \"I wasn't that smart either and I turned out ok\" but then again something seemed amiss, and she could not put her finger on it. Then they met Kimaya's mother - Sandy. She mentioned that Kamaya too had similar challenges, but they had gotten to know of this program that explained brain development stage and how what Sarah was experiencing could be easily understood using that model. It clearly spelt out how chronological age could be different from neurological age and there was nothing right or wrong about this. This all seemed so difficult till Sandy shared a book with a simple diagram to check for milestones at different ages - in fact months. It covered how the brain took inputs (stimulus) and at the child's volition there was output (via speech, movement or any other). It gave simple test such as seeing how much the child could run or what size of text the child could read. It also had a guide on what to do next. Acting on this mother Shaila committed herself to ensuring Sarah would get all the input - stimulation that was relevant for her stage and hand-crafted tens of stories written nice and big. All of these were read to Sarah while her vocabulary was systematically built using flash cards. Along with this Shaila realised a physical program was necessary with some creeping and crawling to build physical strength while helping \"grow the",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "brain\". A year later, Sarah could read at age, was bright eyed and could tolerate loud sounds (the latter thanks to a program that helped her auditory exclusion capabilities). Ever since, Sarah has been a fan of the neuroscience of child brain development and why not! Guidelines for Implementation Chapter 7 TEACHING LEARNING PROCESS: RO 0 A A R Guidelines for Implementation a 7.1 Role of Teachers a. Development of early language and literacy, and mathematics skills is crucial for building the foundation for future learning. As per the National Education Policy, 2020, schooling in the early years lays too little curricular emphasis on foundational literacy and numeracy and, in general, on the reading, writing, and speaking of languages and on mathematical ideas and thinking. Indeed, the curriculum in early grades moves very quickly towards rote learning and more mechanical academic skills, while not giving foundational material its proper due. The principle must be that: if students are given a solid foundation in reading, writing, speaking, counting, arithmetic, mathematical and logical thinking, problem-solving, and in being creative, then all other future lifelong learning will become that much easier, faster, more enjoyable, and more individualised; all curriculum and pedagogy in early grade school must be designed with this principle in mind. b. Therefore, strengthening teaching-learning of early literacy and mathematics is very much essential. Language is intricately linked with thought and understanding. For a young child, a strong foundation of oral language, reading, writing, and thinking skills is the basis for all future learning. Mathematics is one of the core components in early learning. The burden of non- comprehension in early mathematics learning can result in fear and phobia, this continues to bother child in not only later grade mathematics but also across curriculum. Chapters on foundational literacy and numeracy in this provide detailed perspective of pedagogies of early literacy and numeracy. NIPUN BHARAT: National Initiative far Proficiency in Reading with Understanding and Numeracy c. Teachers play vital roles in the lives of the students in their classrooms, especially in the foundational years. Beyond that, teachers serve many other roles in the classroom and schools. Teachers are the managers of their classrooms. They build a warm, inclusive learning environment, mentor and nurture students, become counselor, and listen and look for any symptom or sign of stress, anxiety, or other behavioural problems in students. Teachers need to Care for children and should",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "love to be with them. Understand children within social, cultural and political contexts. Be receptive and be constantly learning. View learning as a search for meaning out of personal experience and knowledge generation as a continuously evolving process of reflective learning. View knowledge not as an external reality embedded in textbooks, but as constructed in the shared context of teaching-learning and personal experience. Own responsibility towards society and work to build a better world. Appreciate the potential of productive work and hands-on experience as a pedagogic medium both inside and outside the classroom. Analyze the curricular, implications and texts. (NCF-2005) d. Facilitating Learning through Knowledge Construction- The most common role a teacher plays in the classroom is to provide children opportunities to learn and construct their own knowledge. Teachers are given a curriculum they need to follow taking care of child's contexts. This curriculum is followed by the teacher so that throughout the year, children should move towards holistic development acquiring all pertinent knowledge, social-personal qualities, values, and skills. Teachers teach in many ways - through interaction, play-way methods, small group activities and hands-on learning activities. With foundational stage learners, teachers need to create situations which replicate their day-to-day life and then implement their plan of learning. e. Creating Classroom Environment- Foundational stage children tend to depend upon teachers and look forward to them for their personal and learning related problems. So, teachers play an especially important role in the classroom when it comes to the environment. Children often mimic a teacher's actions. If the teacher prepares a warm, happy environment, children are more likely to be happy. An Guidelines for Implementation a environment set by the teacher can be either positive or negative. If children sense the teacher is angry, they may react negatively to that and therefore learning can be impaired. Teachers are responsible for the social behavior in their classrooms. This behavior is primarily a reflection of the teacher's actions and the environment she sets. Further, all essential teaching-learning material, that the teachers will require for implementation, must be made available at schools soon after the training programme or at the end of the training itself. f. Motivating and Inspiring- School children spend a major chunk of their time with their teacher and therefore, the teacher becomes a person, whom they like to follow, get inspiration and motivation from or one can say that teacher becomes role",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "model to them. This can be a positive or negative effect depending on the teacher. Teachers are there not only to teach the children, but also to love and care for them. Teachers are typically highly respected by people in the community and therefore become a role model to students and parents. g. Mentoring- Mentoring is an important role of a teacher. It is naturally taken on by the teachers and gels very well with the teaching profession. However, this again can have positive or negative effects on children. Mentoring is a way a teacher encourages students to strive to be the best they can. This also includes encouraging students to enjoy learning. Part of mentoring consists of listening to students. By taking time to listen to what students say, teachers impart to students a sense of ownership in the classroom. This helps build their confidence and helps them want to be successful. h. Counselor- Another role played by teachers is that of a Counselor. Counselor is required the most for adolescent students is a myth. Children at all the stages may develop psychological or learning related problems. Teachers are taught to look for signs of these problems and difficulties. When students' behaviors change or physical signs of abuse are noticed, teachers are required to investigate the problem. Teachers must follow the procedures laid by the school, while taking care of these problems/difficulties of children. 7.2 Understanding and Addressing three major Developmental Goals of Foundational Years As said earlier in this , the 2020, has focused on the holistic development of the child. There are different aspects of development like physical and motor development, socio-emotional development, literacy and language development, cognitive development, spiritual and moral development, art, and NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy aesthetic development which are interrelated and interdependent. All these aspects, for the purpose of looking at competency development in totality and for codifying these competencies for smooth implementation of pedagogic and assessment s, have been subsumed under three major goals. These three goals have been identified for foundational years but may continue to be there for preparatory, middle, and secondary years with some additional goals. Teachers dealing with foundational learners need to achieve these three major goals which are mapped with the concerned competencies/learning outcomes through various pedagogic processes suitable to the age and pace of learners and learning. They",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "also need to carefully address language issues at the foundational year and learn to use multilingual approach. A detailed description of these goals is given in chapter 2. a. Developmental Goal 1: Children Maintain Good Health and Wellbeing This goal is an overarching goal which includes development of competencies related to physical, socio-emotional and psychological health and well-being of children for life. This goal continues to provide experience for health and wellbeing, socio emotional development, health, nutrition, hygienic practices and safety from FYL l - FYL6 (Foundational years level l to 6, age group 3 to 9) b. Developmental Goal 2: Children Become Effective Communicators Communication is an important aspect of one's personality. Sometimes, we know language and can show gestures and postures, but we fail to communicate effectively. Enabling children to orally communicate with ease and competence in the preschool or school language, become print aware, understand, or make a meaningful connect with reading and writing in familiar contexts, develop interest in books and in learning to read is essential. It becomes the hallmark of early initiation of children at the preschool stage into developing their oral language skills and skills of reading and writing. In addition, helping children learn to decode text with ease and focus on developing phonological awareness and sound and visual association becomes important. Once the foundations of language and literacy are laid during the preschool stage (3-6years), this goal leads to subjects -first/second language for example Hindi/state language/English. Guidelines for Implementation a c. Developmental Goal 3: Children become involved learners and connect with their immediate environment. Children begin to know about the world around them much before they enter in the school. Listening, speaking, touching, seeing, grabbing, laughing are some of the actions through which they try to connect themselves with their immediate environment. This ability to connect with others and to share feelings with them lays a special basis for learning- the cultural social basis of human learning. Another major goal of foundational years education is, therefore, to help children move towards more logical thinking by helping them graduate from their perception-bound to more concept-based understanding. This gets addressed by helping children form concepts related to the world around them through direct experience and interactions with the physical, social, and natural environment through language, mathematical thinking and environmental awareness. Moving further to higher classes at the foundational stage, children progress to specific subject",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "areas like mathematics and environmental studies. 7.3 Every Teacher who deals with Foundational Learners must understand Children learn in variety of ways and have different learning levels in each class. Children learn more when they are encouraged to talk and discuss in the classroom. In majority of classrooms, teachers talk most of the time while children either give choral responses or are passive spectators. Activities, like choral repetition, copying from blackboard, are repeatedly done in a mechanical way and do not result in learning. Children soon get disinterested or distracted and their 'time-on-task' is low. Most children are not actively engaged for most of the teaching time. Children get distracted if there is no sense of enjoyment orfun in the learning process. Children do not take interest in learning if teaching in the classroom is textbook centred and the emphasis is on completing the curriculum and if the teaching learning is disconnected from the children's context and real-world experiences. Teachers must be able to provide additional support to children who are lagging. NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy Learning assessment, including examinations, to be largely focused on testing for skills or concept development rather than content. Teaching must integrate continuous assessment. Children join school with informal mathematical thinking as they solve simple problems in real life. Therefore, mathematics learning in the classroom must relate to the child's outside school experiences. There are very few children's reading materials or TLM in most classrooms. Often, there are alphabet and number charts displayed in the classroom or painted on the classroom walls. Thus, children do not get any chance to engage with books or other learning materials. Teachers need to provide a print-rich and toy-rich environment in the classroom. 7.4 Designing FLN CardsforTeachers For developing and tracking the progress of FLN competencies mapped with aforesaid goals using various available support material without any specific syllabus and textbooks, teachers need to have a clear-cut detailed plan for the implementation of FLN. This needs to be developed at the block level following guidelines developed at the national level under three sections as given below- a. Classroom Management This will include guidelines (to be developed at the block level) related to classroom space, seating arrangement, age, abilities, pace of learning, special needs, FLN material, linguistic diversity, children's context, parent/community support, etc. b. Competency Development (including pedagogic perspective) Some sample cards",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "may be given to schools which will include- Goal, competency to be developed, the pedagogic process, assessment approaches to be adopted, etc. Every card must have some blank space for teachers to write the challenges faced in the class and the solutions sought. c. Holistic Assessment (achieving FLN major goals) For every competency, teachers need to keep record of number of children having good progress on the competency and those children who require further support on every aspect of their personality. This may also include the reason for further support. Teachers need to keep records of holistic progress of each child as mention in the chapter 6 on Assessment in this document. This kind of details on cards will help Guidelines for Implementation a teachers to quickly provide report of progress of each child in consolidated form whenever required. 7.5 Capacity building of Teachers a. Teacher capacity plays a central role in the attainment of foundational skills. Currently, few teachers have had the opportunity to be trained in a multilevel, play based, student-centred style of learning that, according to extensive ECCE research, is so important for students in early grade school, particularly in Grades 1 and 2. Children naturally learn at different levels and paces during their early school years. However, the current formal system assumes from the very beginning a common level and pace for all, due to which many students start to fall behind almost immediately b. Regular professional development focusing on pre-school education and Foundational Literacy and Numeracy is yet not systematic. If we look at the challenges of designing in-service training programmes for school teachers, we find that they are mostly designed at the state level, and often do not address real classroom issues, like multilevel learning situation, language diversity, etc. Many training programmes cover topics for all primary classes and are not focused on early primary classes. Training sessions are often delivered in lecture mode, with little discussion and activities. There is inadequate scope for experience sharing and practising new methods to demonstrate their effectiveness. Trainings are not followed up with further refresher workshops and on-site or other forms of mentoring for teachers. Since pre-school education in schools has recently been covered under Samagra Shiksha, in-service training in this area is still a major challenge across states and municipal corporations running pre- primary sections. In most cases, the training is inadequate. Similarly, capacities and training",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "of anganwadi workers in this regard are inadequate. c. In view of the challenges of in-service teacher training across the different stages of school education, NCERT has designed an innovative integrated programme of teacher training, now, popularly known as NISHTHA (National Initiative for School Heads' and Teachers' Holistic Advancement). This was launched by the Ministry of Human Resource Development (now known as Ministry of Education) in August 2019. This includes one module on pre-school education and focuses on early literacy and numeracy across the modules like- EVS, Mathematics and Languages. The specific feature of NISHTHA is interactivity with teachers. It provides teachers opportunities to not only share their concerns and problems with the NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy Resource Persons but also to present solutions of these problems through their activities and presentations. d. Following NISHTHA model, a customized FLN package for teachers teaching at foundational stage of education will be designed covering the continuum from pre-school to the early primary grades, to meet the specific content and pedagogical requirements. This package may cover following modules: Understanding Foundational Learners and Learning Social-personal Qualities, Environmental Concerns and Values Early Language and Literacy Early Numeracy Assessment in Early Years Counselling in Early Years Identifying and addressing needs of Children with Special Needs in Early Years Role of CRC/BRC in achieving goals of FLN Mission. Addressing Teachers' Beliefs and Attitudes towards learners at the foundation stage Pedagogic approaches including Art-integrated learning and Toy and Game based approach Promoting role of parents and community in foundational literacy and numeracy. On an average, two teachers and the school head in a school having pre-school and primary sections needs to be trained for the implementation of FLN as per the 2020 perspectives. This training will be based on the above suggestive modules. This training will be of seven-day duration in face-to-face mode or will be of one month in online mode. Besides, these modules, which will include relevant and necessary activities for strengthening FLN, every teacher and school head will be expected to conduct action research to immediately solve problems related to foundational learning in the Classrooms and will also develop low cost innovative TLM as follow-up activities of the capacity building programme. Face-to-face training will be conducted by the SCERTs at the state level. Guidelines for Implementation a Further, Study groups (Professional Learning Communities) among peers focused on",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "a shared need or topic may be created. Monthly meetings at cluster/block level to learn a new strategy, plan lessons and address classroom issues, like analysis of student assessment results may be conducted. Conferences and seminars to learn from a variety of expertise from around the state or country may be conducted. 7.6 Creating a Pool of Key Resource Persons for Mentoring and Guiding Teachers Some selected faculty members from DIETs, SCERTs, school heads and teachers may be given 7-day training for FLN mentorship based on the above mentioned l 0 modules. They will form a pool of Key Resource Persons, who will be directly giving training to teachers through face-to-face mode or interact with teachers once they have attended theironline modules on DIKSHA. 6 KRPs for teachers may be taken as optimum ratio to impart training and for mentorship as FLN sessions will require many hands-on activities and intense discussion on foundational learners' learning needs. SCERTs need to identify school heads, teachers and their faculty members and DIET faculty members who can play a role of mentor for the FLN teachers. Their trainings may be conducted at the national and the state level. Training of Key Resource Persons must be planned carefully for the 7 day duration. Availability of all materials required for the training programme including training modules, FLN activity kit including variety of colourful toys, voice and video-recording tools, ORF tool, worksheets, drawing sheets, other supportive materials for the training sessions, like handouts, videos, reading resources for teachers, teaching learning materials to demonstrate and use for practicing implementation of the instructional strategies, teacher handbook, etc., should be ensured prior to organizing the training. 7.7 Designing Advance Courses in Pedagogies (including toy- based pedagogy, assessments, classroom transactions, etc.) For developing professionals around Foundational Literacy and Numeracy, short and long-term advance courses in FLN pedagogy may be designed and offered by the NCERT and SCERTs within 2-3 years from now. These courses will be offered for NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy teacher educators, school heads and teachers. These courses may be designed for face-to-face and online/blended mode. Digital content related to various themes under different courses may also be developed. Some proposed courses which may be designed are- Language Literacy and Numeracy at the Foundational Stage, Assessment for Foundational Literacy and Numeracy, Toy-based pedagogy for FLN which will help in developing a",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "professional who can further help in developing skills of using and creating toys for small children thereby making the whole learning process child-friendly. etc. These courses may be of six-month duration, and must focus on development of knowledge, skills, and positive attitudes to strengthen FLN of children. Addressing Teachers' Beliefs and Attitudes towards learners at the foundation stage through In-service Teacher Training Talking to teachers at various occasions, one can find that they often express their own beliefs and assumptions about abilities, languages, and cultures of their children. These inform their practice in class. Often these beliefs and attitudes do not get addressed during pre-service teacher education and get reinforced in the system further. As per many research studies, teachers often expressed that children from deprived social and economic background with illiterate parents will not be able to learn everything taught in class and therefore, have low expectations from these children. Further, they also believe that teaching-learning of language literacy must start with alphabets. Children's home languages are a problem. Many home languages are considered inferior to the standard language. In case of mathematics learning, most teachers believe that once they have demonstrated a procedure followed by repeated practice by children, it will result in mastery in the concept. Hence, it is necessary to address these misconceptions in the in-service training programmes to make for effective implementation of foundational learning in the classroom. Guidelines for Implementation a 7.8 Contextualizing Low Cost TLMs (worksheets, story books, etc.) Working with foundational stage learners, i.e., in the age group of 3-9 years, teachers may require variety of teaching learning material to get children engaged in meaningful activities. These may be toy kit, ECCE kit, FLN kit, worksheets, story books, digital activities, and content, etc. Once developed as model at the national level, these materials will be contextualized at the state level by the SCERTs. These may further be contextualized, if required, at the block level. While contextualizing these materials, linguistic and social diversity in each State/UT need to be kept in view. Large size pictures/ conversation charts Pictures from newspapers or magazines Book of rhymes/ Posters with rhymes Puppets and masks for storytelling Varna and Akshara chart Grids of aksharas for blending practice Variety of games using grids and dice, including bingo Rhymes with words from group of aksharas being learnt Worksheets for children to write words and draw Worksheets for colouring and",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  },
  {
    "content": "painting Drawing Sheets Colour pens and crayons 7.9 Enabling Classroom Transactions:Sustained & Active Engagement with Every Child NIPUN BHARAT: National Initiative for Proficiency in Reading with Understanding and Numeracy There are some important points the teachers should keep in mind during classroom transaction: A daily dedicated slot for FLN - minutes for language and minutes for numeracy needs to be included in daily schedule of activities. Teachers are free to design their own or use the existing activities and worksheets, toys etc. for achieving pre-determined early learning outcomes. Make activities flexible and accessible to children with special needs. The mother tongue is to be used as medium of instruction and teacher should welcome as many as languages in the classroom and appreciate. Use multilingualism in the classroom as a resource. Print rich classroom environment should be created in the form of word walls, story books, posters to assist in development of print awareness and literacy skills. Good quality teaching learning material for both students and teachers should be made available. Use indigenous/ locally available material which is low cost or no-cost and easily accessible. Make sure children can manipulate the material and have safe accessibility to the material and other resources. Variety of activity areas like reading area, creative area, etc. need to be designed by teachers to encourage free play, social-emotional development skill etc. Display of materiaI should be at the eye level of the children. Guidelines for Implementation",
    "metadata": {
      "source": "NCERT",
      "category": "pedagogy",
      "language": "English"
    }
  }
]